rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xl.h
typedef struct stc_canfd_txbtie_field
{
        __IO  uint32_t  TIE0                     :1;
        __IO  uint32_t  TIE1                     :1;
        __IO  uint32_t  TIE2                     :1;
        __IO  uint32_t  TIE3                     :1;
        __IO  uint32_t  TIE4                     :1;
        __IO  uint32_t  TIE5                     :1;
        __IO  uint32_t  TIE6                     :1;
        __IO  uint32_t  TIE7                     :1;
        __IO  uint32_t  TIE8                     :1;
        __IO  uint32_t  TIE9                     :1;
        __IO  uint32_t  TIE10                    :1;
        __IO  uint32_t  TIE11                    :1;
        __IO  uint32_t  TIE12                    :1;
        __IO  uint32_t  TIE13                    :1;
        __IO  uint32_t  TIE14                    :1;
        __IO  uint32_t  TIE15                    :1;
        __IO  uint32_t  TIE16                    :1;
        __IO  uint32_t  TIE17                    :1;
        __IO  uint32_t  TIE18                    :1;
        __IO  uint32_t  TIE19                    :1;
        __IO  uint32_t  TIE20                    :1;
        __IO  uint32_t  TIE21                    :1;
        __IO  uint32_t  TIE22                    :1;
        __IO  uint32_t  TIE23                    :1;
        __IO  uint32_t  TIE24                    :1;
        __IO  uint32_t  TIE25                    :1;
        __IO  uint32_t  TIE26                    :1;
        __IO  uint32_t  TIE27                    :1;
        __IO  uint32_t  TIE28                    :1;
        __IO  uint32_t  TIE29                    :1;
        __IO  uint32_t  TIE30                    :1;
        __IO  uint32_t  TIE31                    :1;
} stc_canfd_txbtie_field_t;

typedef struct stc_canfd_txbcie_field
{
        __IO  uint32_t  CFIE0                    :1;
        __IO  uint32_t  CFIE1                    :1;
        __IO  uint32_t  CFIE2                    :1;
        __IO  uint32_t  CFIE3                    :1;
        __IO  uint32_t  CFIE4                    :1;
        __IO  uint32_t  CFIE5                    :1;
        __IO  uint32_t  CFIE6                    :1;
        __IO  uint32_t  CFIE7                    :1;
        __IO  uint32_t  CFIE8                    :1;
        __IO  uint32_t  CFIE9                    :1;
        __IO  uint32_t  CFIE10                   :1;
        __IO  uint32_t  CFIE11                   :1;
        __IO  uint32_t  CFIE12                   :1;
        __IO  uint32_t  CFIE13                   :1;
        __IO  uint32_t  CFIE14                   :1;
        __IO  uint32_t  CFIE15                   :1;
        __IO  uint32_t  CFIE16                   :1;
        __IO  uint32_t  CFIE17                   :1;
        __IO  uint32_t  CFIE18                   :1;
        __IO  uint32_t  CFIE19                   :1;
        __IO  uint32_t  CFIE20                   :1;
        __IO  uint32_t  CFIE21                   :1;
        __IO  uint32_t  CFIE22                   :1;
        __IO  uint32_t  CFIE23                   :1;
        __IO  uint32_t  CFIE24                   :1;
        __IO  uint32_t  CFIE25                   :1;
        __IO  uint32_t  CFIE26                   :1;
        __IO  uint32_t  CFIE27                   :1;
        __IO  uint32_t  CFIE28                   :1;
        __IO  uint32_t  CFIE29                   :1;
        __IO  uint32_t  CFIE30                   :1;
        __IO  uint32_t  CFIE31                   :1;
} stc_canfd_txbcie_field_t;

typedef struct stc_canfd_txefc_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  EFSA                 :14;
            __IO  uint32_t  EFS                  :6;
            __IO  uint32_t  RESERVED2            :2;
            __IO  uint32_t  EFWM                 :6;
            __IO  uint32_t  RESERVED4            :2;
        };
        struct {
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  EFSA0                :1;
            __IO  uint32_t  EFSA1                :1;
            __IO  uint32_t  EFSA2                :1;
            __IO  uint32_t  EFSA3                :1;
            __IO  uint32_t  EFSA4                :1;
            __IO  uint32_t  EFSA5                :1;
            __IO  uint32_t  EFSA6                :1;
            __IO  uint32_t  EFSA7                :1;
            __IO  uint32_t  EFSA8                :1;
            __IO  uint32_t  EFSA9                :1;
            __IO  uint32_t  EFSA10               :1;
            __IO  uint32_t  EFSA11               :1;
            __IO  uint32_t  EFSA12               :1;
            __IO  uint32_t  EFSA13               :1;
            __IO  uint32_t  EFS0                 :1;
            __IO  uint32_t  EFS1                 :1;
            __IO  uint32_t  EFS2                 :1;
            __IO  uint32_t  EFS3                 :1;
            __IO  uint32_t  EFS4                 :1;
            __IO  uint32_t  EFS5                 :1;
            __IO  uint32_t  RESERVED3            :2;
            __IO  uint32_t  EFWM0                :1;
            __IO  uint32_t  EFWM1                :1;
            __IO  uint32_t  EFWM2                :1;
            __IO  uint32_t  EFWM3                :1;
            __IO  uint32_t  EFWM4                :1;
            __IO  uint32_t  EFWM5                :1;
            __IO  uint32_t  RESERVED5            :2;
        };
    };
} stc_canfd_txefc_field_t;

typedef struct stc_canfd_txfs_field
{
    union {
        struct {
            __IO  uint32_t  EFFL                 :6;
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  EFGI                 :5;
            __IO  uint32_t  RESERVED2            :3;
            __IO  uint32_t  EFPI                 :5;
            __IO  uint32_t  RESERVED4            :3;
            __IO  uint32_t  EFF                  :1;
            __IO  uint32_t  TEFL                 :1;
            __IO  uint32_t  RESERVED5            :6;
        };
        struct {
            __IO  uint32_t  EFFL0                :1;
            __IO  uint32_t  EFFL1                :1;
            __IO  uint32_t  EFFL2                :1;
            __IO  uint32_t  EFFL3                :1;
            __IO  uint32_t  EFFL4                :1;
            __IO  uint32_t  EFFL5                :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  EFGI0                :1;
            __IO  uint32_t  EFGI1                :1;
            __IO  uint32_t  EFGI2                :1;
            __IO  uint32_t  EFGI3                :1;
            __IO  uint32_t  EFGI4                :1;
            __IO  uint32_t  RESERVED3            :3;
            __IO  uint32_t  EFPI0                :1;
            __IO  uint32_t  EFPI1                :1;
            __IO  uint32_t  EFPI2                :1;
            __IO  uint32_t  EFPI3                :1;
            __IO  uint32_t  EFPI4                :1;
            __IO  uint32_t  RESERVED6            :11;
        };
    };
} stc_canfd_txfs_field_t;

typedef struct stc_canfd_txfa_field
{
    union {
        struct {
            __IO  uint32_t  EFAI                 :5;
            __IO  uint32_t  RESERVED0            :27;
        };
        struct {
            __IO  uint32_t  EFAI0                :1;
            __IO  uint32_t  EFAI1                :1;
            __IO  uint32_t  EFAI2                :1;
            __IO  uint32_t  EFAI3                :1;
            __IO  uint32_t  EFAI4                :1;
            __IO  uint32_t  RESERVED1            :27;
        };
    };
} stc_canfd_txfa_field_t;

