rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xl.h
/*******************************************************************************
* HWWDT_MODULE
*******************************************************************************/
typedef struct stc_hwwdt_wdg_ctl_field
{
        __IO  uint32_t  INTEN                    :1;
        __IO  uint32_t  RESEN                    :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_hwwdt_wdg_ctl_field_t;

typedef struct stc_hwwdt_wdg_ris_field
{
        __IO  uint32_t  RIS                      :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_hwwdt_wdg_ris_field_t;

/*******************************************************************************
* I2S_MODULE
*******************************************************************************/
typedef struct stc_i2s_rxfdat_field
{
    union {
        struct {
            __IO  uint32_t  RXDATA               :32;
        };
        struct {
            __IO  uint32_t  RXDATA0              :1;
            __IO  uint32_t  RXDATA1              :1;
            __IO  uint32_t  RXDATA2              :1;
            __IO  uint32_t  RXDATA3              :1;
            __IO  uint32_t  RXDATA4              :1;
            __IO  uint32_t  RXDATA5              :1;
            __IO  uint32_t  RXDATA6              :1;
            __IO  uint32_t  RXDATA7              :1;
            __IO  uint32_t  RXDATA8              :1;
            __IO  uint32_t  RXDATA9              :1;
            __IO  uint32_t  RXDATA10             :1;
            __IO  uint32_t  RXDATA11             :1;
            __IO  uint32_t  RXDATA12             :1;
            __IO  uint32_t  RXDATA13             :1;
            __IO  uint32_t  RXDATA14             :1;
            __IO  uint32_t  RXDATA15             :1;
            __IO  uint32_t  RXDATA16             :1;
            __IO  uint32_t  RXDATA17             :1;
            __IO  uint32_t  RXDATA18             :1;
            __IO  uint32_t  RXDATA19             :1;
            __IO  uint32_t  RXDATA20             :1;
            __IO  uint32_t  RXDATA21             :1;
            __IO  uint32_t  RXDATA22             :1;
            __IO  uint32_t  RXDATA23             :1;
            __IO  uint32_t  RXDATA24             :1;
            __IO  uint32_t  RXDATA25             :1;
            __IO  uint32_t  RXDATA26             :1;
            __IO  uint32_t  RXDATA27             :1;
            __IO  uint32_t  RXDATA28             :1;
            __IO  uint32_t  RXDATA29             :1;
            __IO  uint32_t  RXDATA30             :1;
            __IO  uint32_t  RXDATA31             :1;
        };
    };
} stc_i2s_rxfdat_field_t;

typedef struct stc_i2s_txfdat_field
{
    union {
        struct {
            __IO  uint32_t  TXDATA               :32;
        };
        struct {
            __IO  uint32_t  TXDATA0              :1;
            __IO  uint32_t  TXDATA1              :1;
            __IO  uint32_t  TXDATA2              :1;
            __IO  uint32_t  TXDATA3              :1;
            __IO  uint32_t  TXDATA4              :1;
            __IO  uint32_t  TXDATA5              :1;
            __IO  uint32_t  TXDATA6              :1;
            __IO  uint32_t  TXDATA7              :1;
            __IO  uint32_t  TXDATA8              :1;
            __IO  uint32_t  TXDATA9              :1;
            __IO  uint32_t  TXDATA10             :1;
            __IO  uint32_t  TXDATA11             :1;
            __IO  uint32_t  TXDATA12             :1;
            __IO  uint32_t  TXDATA13             :1;
            __IO  uint32_t  TXDATA14             :1;
            __IO  uint32_t  TXDATA15             :1;
            __IO  uint32_t  TXDATA16             :1;
            __IO  uint32_t  TXDATA17             :1;
            __IO  uint32_t  TXDATA18             :1;
            __IO  uint32_t  TXDATA19             :1;
            __IO  uint32_t  TXDATA20             :1;
            __IO  uint32_t  TXDATA21             :1;
            __IO  uint32_t  TXDATA22             :1;
            __IO  uint32_t  TXDATA23             :1;
            __IO  uint32_t  TXDATA24             :1;
            __IO  uint32_t  TXDATA25             :1;
            __IO  uint32_t  TXDATA26             :1;
            __IO  uint32_t  TXDATA27             :1;
            __IO  uint32_t  TXDATA28             :1;
            __IO  uint32_t  TXDATA29             :1;
            __IO  uint32_t  TXDATA30             :1;
            __IO  uint32_t  TXDATA31             :1;
        };
    };
} stc_i2s_txfdat_field_t;

typedef struct stc_i2s_cntreg_field
{
    union {
        struct {
            __IO  uint32_t  FSPL                 :1;
            __IO  uint32_t  FSLN                 :1;
            __IO  uint32_t  FSPH                 :1;
            __IO  uint32_t  CPOL                 :1;
            __IO  uint32_t  SMPL                 :1;
            __IO  uint32_t  RXDIS                :1;
            __IO  uint32_t  TXDIS                :1;
            __IO  uint32_t  MLSB                 :1;
            __IO  uint32_t  FRUN                 :1;
            __IO  uint32_t  BEXT                 :1;
            __IO  uint32_t  ECKM                 :1;
            __IO  uint32_t  RHLL                 :1;
            __IO  uint32_t  SBFN                 :1;
            __IO  uint32_t  MSMD                 :1;
            __IO  uint32_t  MSKB                 :1;
            __IO  uint32_t  RESERVED0            :1;
            __IO  uint32_t  OVHD                 :10;
            __IO  uint32_t  CKRT                 :6;
        };
        struct {
            __IO  uint32_t  RESERVED1            :16;
            __IO  uint32_t  OVHD0                :1;
            __IO  uint32_t  OVHD1                :1;
            __IO  uint32_t  OVHD2                :1;
            __IO  uint32_t  OVHD3                :1;
            __IO  uint32_t  OVHD4                :1;
            __IO  uint32_t  OVHD5                :1;
            __IO  uint32_t  OVHD6                :1;
            __IO  uint32_t  OVHD7                :1;
            __IO  uint32_t  OVHD8                :1;
            __IO  uint32_t  OVHD9                :1;
            __IO  uint32_t  CKRT0                :1;
            __IO  uint32_t  CKRT1                :1;
            __IO  uint32_t  CKRT2                :1;
            __IO  uint32_t  CKRT3                :1;
            __IO  uint32_t  CKRT4                :1;
            __IO  uint32_t  CKRT5                :1;
        };
    };
} stc_i2s_cntreg_field_t;

