rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xl.h
/*******************************************************************************
* BT Registers BT8
*   Register Definition
*******************************************************************************/
#define FM_BT8_PPG_PRLL                           *((volatile uint16_t*)(0x40025400UL))
#define FM4_BT8_PPG_PRLL                          *((volatile uint16_t*)(0x40025400UL))
#define FM_BT8_PWM_PCSR                           *((volatile uint16_t*)(0x40025400UL))
#define FM4_BT8_PWM_PCSR                          *((volatile uint16_t*)(0x40025400UL))
#define FM_BT8_RT_PCSR                            *((volatile uint16_t*)(0x40025400UL))
#define FM4_BT8_RT_PCSR                           *((volatile uint16_t*)(0x40025400UL))
#define FM_BT8_PPG_PRLH                           *((volatile uint16_t*)(0x40025404UL))
#define FM4_BT8_PPG_PRLH                          *((volatile uint16_t*)(0x40025404UL))
#define FM_BT8_PWC_DTBF                           *((volatile uint16_t*)(0x40025404UL))
#define FM4_BT8_PWC_DTBF                          *((volatile uint16_t*)(0x40025404UL))
#define FM_BT8_PWM_PDUT                           *((volatile uint16_t*)(0x40025404UL))
#define FM4_BT8_PWM_PDUT                          *((volatile uint16_t*)(0x40025404UL))
#define FM_BT8_PPG_TMR                            *((volatile uint16_t*)(0x40025408UL))
#define FM4_BT8_PPG_TMR                           *((volatile uint16_t*)(0x40025408UL))
#define FM_BT8_PWM_TMR                            *((volatile uint16_t*)(0x40025408UL))
#define FM4_BT8_PWM_TMR                           *((volatile uint16_t*)(0x40025408UL))
#define FM_BT8_RT_TMR                             *((volatile uint16_t*)(0x40025408UL))
#define FM4_BT8_RT_TMR                            *((volatile uint16_t*)(0x40025408UL))
#define FM_BT8_PPG_TMCR                           *((volatile uint16_t*)(0x4002540CUL))
#define FM4_BT8_PPG_TMCR                          *((volatile uint16_t*)(0x4002540CUL))
#define FM_BT8_PWC_TMCR                           *((volatile uint16_t*)(0x4002540CUL))
#define FM4_BT8_PWC_TMCR                          *((volatile uint16_t*)(0x4002540CUL))
#define FM_BT8_PWM_TMCR                           *((volatile uint16_t*)(0x4002540CUL))
#define FM4_BT8_PWM_TMCR                          *((volatile uint16_t*)(0x4002540CUL))
#define FM_BT8_RT_TMCR                            *((volatile uint16_t*)(0x4002540CUL))
#define FM4_BT8_RT_TMCR                           *((volatile uint16_t*)(0x4002540CUL))
#define FM_BT8_PPG_STC                            *((volatile  uint8_t*)(0x40025410UL))
#define FM4_BT8_PPG_STC                           *((volatile  uint8_t*)(0x40025410UL))
#define FM_BT8_PWC_STC                            *((volatile  uint8_t*)(0x40025410UL))
#define FM4_BT8_PWC_STC                           *((volatile  uint8_t*)(0x40025410UL))
#define FM_BT8_PWM_STC                            *((volatile  uint8_t*)(0x40025410UL))
#define FM4_BT8_PWM_STC                           *((volatile  uint8_t*)(0x40025410UL))
#define FM_BT8_RT_STC                             *((volatile  uint8_t*)(0x40025410UL))
#define FM4_BT8_RT_STC                            *((volatile  uint8_t*)(0x40025410UL))
#define FM_BT8_PPG_TMCR2                          *((volatile  uint8_t*)(0x40025411UL))
#define FM4_BT8_PPG_TMCR2                         *((volatile  uint8_t*)(0x40025411UL))
#define FM_BT8_PWC_TMCR2                          *((volatile  uint8_t*)(0x40025411UL))
#define FM4_BT8_PWC_TMCR2                         *((volatile  uint8_t*)(0x40025411UL))
#define FM_BT8_PWM_TMCR2                          *((volatile  uint8_t*)(0x40025411UL))
#define FM4_BT8_PWM_TMCR2                         *((volatile  uint8_t*)(0x40025411UL))
#define FM_BT8_RT_TMCR2                           *((volatile  uint8_t*)(0x40025411UL))
#define FM4_BT8_RT_TMCR2                          *((volatile  uint8_t*)(0x40025411UL))

/*******************************************************************************
* BT Registers BT9
*   Register Definition
*******************************************************************************/
#define FM_BT9_PPG_PRLL                           *((volatile uint16_t*)(0x40025440UL))
#define FM4_BT9_PPG_PRLL                          *((volatile uint16_t*)(0x40025440UL))
#define FM_BT9_PWM_PCSR                           *((volatile uint16_t*)(0x40025440UL))
#define FM4_BT9_PWM_PCSR                          *((volatile uint16_t*)(0x40025440UL))
#define FM_BT9_RT_PCSR                            *((volatile uint16_t*)(0x40025440UL))
#define FM4_BT9_RT_PCSR                           *((volatile uint16_t*)(0x40025440UL))
#define FM_BT9_PPG_PRLH                           *((volatile uint16_t*)(0x40025444UL))
#define FM4_BT9_PPG_PRLH                          *((volatile uint16_t*)(0x40025444UL))
#define FM_BT9_PWC_DTBF                           *((volatile uint16_t*)(0x40025444UL))
#define FM4_BT9_PWC_DTBF                          *((volatile uint16_t*)(0x40025444UL))
#define FM_BT9_PWM_PDUT                           *((volatile uint16_t*)(0x40025444UL))
#define FM4_BT9_PWM_PDUT                          *((volatile uint16_t*)(0x40025444UL))
#define FM_BT9_PPG_TMR                            *((volatile uint16_t*)(0x40025448UL))
#define FM4_BT9_PPG_TMR                           *((volatile uint16_t*)(0x40025448UL))
#define FM_BT9_PWM_TMR                            *((volatile uint16_t*)(0x40025448UL))
#define FM4_BT9_PWM_TMR                           *((volatile uint16_t*)(0x40025448UL))
#define FM_BT9_RT_TMR                             *((volatile uint16_t*)(0x40025448UL))
#define FM4_BT9_RT_TMR                            *((volatile uint16_t*)(0x40025448UL))
#define FM_BT9_PPG_TMCR                           *((volatile uint16_t*)(0x4002544CUL))
#define FM4_BT9_PPG_TMCR                          *((volatile uint16_t*)(0x4002544CUL))
#define FM_BT9_PWC_TMCR                           *((volatile uint16_t*)(0x4002544CUL))
#define FM4_BT9_PWC_TMCR                          *((volatile uint16_t*)(0x4002544CUL))
#define FM_BT9_PWM_TMCR                           *((volatile uint16_t*)(0x4002544CUL))
#define FM4_BT9_PWM_TMCR                          *((volatile uint16_t*)(0x4002544CUL))
#define FM_BT9_RT_TMCR                            *((volatile uint16_t*)(0x4002544CUL))
#define FM4_BT9_RT_TMCR                           *((volatile uint16_t*)(0x4002544CUL))
#define FM_BT9_PPG_STC                            *((volatile  uint8_t*)(0x40025450UL))
#define FM4_BT9_PPG_STC                           *((volatile  uint8_t*)(0x40025450UL))
#define FM_BT9_PWC_STC                            *((volatile  uint8_t*)(0x40025450UL))
#define FM4_BT9_PWC_STC                           *((volatile  uint8_t*)(0x40025450UL))
#define FM_BT9_PWM_STC                            *((volatile  uint8_t*)(0x40025450UL))
#define FM4_BT9_PWM_STC                           *((volatile  uint8_t*)(0x40025450UL))
#define FM_BT9_RT_STC                             *((volatile  uint8_t*)(0x40025450UL))
#define FM4_BT9_RT_STC                            *((volatile  uint8_t*)(0x40025450UL))
#define FM_BT9_PPG_TMCR2                          *((volatile  uint8_t*)(0x40025451UL))
#define FM4_BT9_PPG_TMCR2                         *((volatile  uint8_t*)(0x40025451UL))
#define FM_BT9_PWC_TMCR2                          *((volatile  uint8_t*)(0x40025451UL))
#define FM4_BT9_PWC_TMCR2                         *((volatile  uint8_t*)(0x40025451UL))
#define FM_BT9_PWM_TMCR2                          *((volatile  uint8_t*)(0x40025451UL))
#define FM4_BT9_PWM_TMCR2                         *((volatile  uint8_t*)(0x40025451UL))
#define FM_BT9_RT_TMCR2                           *((volatile  uint8_t*)(0x40025451UL))
#define FM4_BT9_RT_TMCR2                          *((volatile  uint8_t*)(0x40025451UL))

