rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xl.h
#define bFM_GPIO_PDIR1_P0                         *((volatile  uint8_t *)(0x42DE6080UL))
#define bFM4_GPIO_PDIR1_P0                        *((volatile  uint8_t *)(0x42DE6080UL))
#define bFM_GPIO_PDIR1_P1                         *((volatile  uint8_t *)(0x42DE6084UL))
#define bFM4_GPIO_PDIR1_P1                        *((volatile  uint8_t *)(0x42DE6084UL))
#define bFM_GPIO_PDIR1_P2                         *((volatile  uint8_t *)(0x42DE6088UL))
#define bFM4_GPIO_PDIR1_P2                        *((volatile  uint8_t *)(0x42DE6088UL))
#define bFM_GPIO_PDIR1_P3                         *((volatile  uint8_t *)(0x42DE608CUL))
#define bFM4_GPIO_PDIR1_P3                        *((volatile  uint8_t *)(0x42DE608CUL))
#define bFM_GPIO_PDIR1_P4                         *((volatile  uint8_t *)(0x42DE6090UL))
#define bFM4_GPIO_PDIR1_P4                        *((volatile  uint8_t *)(0x42DE6090UL))
#define bFM_GPIO_PDIR1_P5                         *((volatile  uint8_t *)(0x42DE6094UL))
#define bFM4_GPIO_PDIR1_P5                        *((volatile  uint8_t *)(0x42DE6094UL))
#define bFM_GPIO_PDIR1_P6                         *((volatile  uint8_t *)(0x42DE6098UL))
#define bFM4_GPIO_PDIR1_P6                        *((volatile  uint8_t *)(0x42DE6098UL))
#define bFM_GPIO_PDIR1_P7                         *((volatile  uint8_t *)(0x42DE609CUL))
#define bFM4_GPIO_PDIR1_P7                        *((volatile  uint8_t *)(0x42DE609CUL))
#define bFM_GPIO_PDIR1_P8                         *((volatile  uint8_t *)(0x42DE60A0UL))
#define bFM4_GPIO_PDIR1_P8                        *((volatile  uint8_t *)(0x42DE60A0UL))
#define bFM_GPIO_PDIR1_P9                         *((volatile  uint8_t *)(0x42DE60A4UL))
#define bFM4_GPIO_PDIR1_P9                        *((volatile  uint8_t *)(0x42DE60A4UL))
#define bFM_GPIO_PDIR1_PA                         *((volatile  uint8_t *)(0x42DE60A8UL))
#define bFM4_GPIO_PDIR1_PA                        *((volatile  uint8_t *)(0x42DE60A8UL))
#define bFM_GPIO_PDIR1_PB                         *((volatile  uint8_t *)(0x42DE60ACUL))
#define bFM4_GPIO_PDIR1_PB                        *((volatile  uint8_t *)(0x42DE60ACUL))
#define bFM_GPIO_PDIR1_PC                         *((volatile  uint8_t *)(0x42DE60B0UL))
#define bFM4_GPIO_PDIR1_PC                        *((volatile  uint8_t *)(0x42DE60B0UL))
#define bFM_GPIO_PDIR1_PD                         *((volatile  uint8_t *)(0x42DE60B4UL))
#define bFM4_GPIO_PDIR1_PD                        *((volatile  uint8_t *)(0x42DE60B4UL))
#define bFM_GPIO_PDIR1_PE                         *((volatile  uint8_t *)(0x42DE60B8UL))
#define bFM4_GPIO_PDIR1_PE                        *((volatile  uint8_t *)(0x42DE60B8UL))
#define bFM_GPIO_PDIR1_PF                         *((volatile  uint8_t *)(0x42DE60BCUL))
#define bFM4_GPIO_PDIR1_PF                        *((volatile  uint8_t *)(0x42DE60BCUL))

#define bFM_GPIO_PDIR2_P0                         *((volatile  uint8_t *)(0x42DE6100UL))
#define bFM4_GPIO_PDIR2_P0                        *((volatile  uint8_t *)(0x42DE6100UL))
#define bFM_GPIO_PDIR2_P1                         *((volatile  uint8_t *)(0x42DE6104UL))
#define bFM4_GPIO_PDIR2_P1                        *((volatile  uint8_t *)(0x42DE6104UL))
#define bFM_GPIO_PDIR2_P2                         *((volatile  uint8_t *)(0x42DE6108UL))
#define bFM4_GPIO_PDIR2_P2                        *((volatile  uint8_t *)(0x42DE6108UL))
#define bFM_GPIO_PDIR2_P3                         *((volatile  uint8_t *)(0x42DE610CUL))
#define bFM4_GPIO_PDIR2_P3                        *((volatile  uint8_t *)(0x42DE610CUL))
#define bFM_GPIO_PDIR2_P4                         *((volatile  uint8_t *)(0x42DE6110UL))
#define bFM4_GPIO_PDIR2_P4                        *((volatile  uint8_t *)(0x42DE6110UL))
#define bFM_GPIO_PDIR2_P5                         *((volatile  uint8_t *)(0x42DE6114UL))
#define bFM4_GPIO_PDIR2_P5                        *((volatile  uint8_t *)(0x42DE6114UL))
#define bFM_GPIO_PDIR2_P6                         *((volatile  uint8_t *)(0x42DE6118UL))
#define bFM4_GPIO_PDIR2_P6                        *((volatile  uint8_t *)(0x42DE6118UL))
#define bFM_GPIO_PDIR2_P7                         *((volatile  uint8_t *)(0x42DE611CUL))
#define bFM4_GPIO_PDIR2_P7                        *((volatile  uint8_t *)(0x42DE611CUL))
#define bFM_GPIO_PDIR2_P8                         *((volatile  uint8_t *)(0x42DE6120UL))
#define bFM4_GPIO_PDIR2_P8                        *((volatile  uint8_t *)(0x42DE6120UL))
#define bFM_GPIO_PDIR2_P9                         *((volatile  uint8_t *)(0x42DE6124UL))
#define bFM4_GPIO_PDIR2_P9                        *((volatile  uint8_t *)(0x42DE6124UL))
#define bFM_GPIO_PDIR2_PA                         *((volatile  uint8_t *)(0x42DE6128UL))
#define bFM4_GPIO_PDIR2_PA                        *((volatile  uint8_t *)(0x42DE6128UL))

#define bFM_GPIO_PDIR3_P0                         *((volatile  uint8_t *)(0x42DE6180UL))
#define bFM4_GPIO_PDIR3_P0                        *((volatile  uint8_t *)(0x42DE6180UL))
#define bFM_GPIO_PDIR3_P1                         *((volatile  uint8_t *)(0x42DE6184UL))
#define bFM4_GPIO_PDIR3_P1                        *((volatile  uint8_t *)(0x42DE6184UL))
#define bFM_GPIO_PDIR3_P2                         *((volatile  uint8_t *)(0x42DE6188UL))
#define bFM4_GPIO_PDIR3_P2                        *((volatile  uint8_t *)(0x42DE6188UL))
#define bFM_GPIO_PDIR3_P3                         *((volatile  uint8_t *)(0x42DE618CUL))
#define bFM4_GPIO_PDIR3_P3                        *((volatile  uint8_t *)(0x42DE618CUL))
#define bFM_GPIO_PDIR3_P4                         *((volatile  uint8_t *)(0x42DE6190UL))
#define bFM4_GPIO_PDIR3_P4                        *((volatile  uint8_t *)(0x42DE6190UL))
#define bFM_GPIO_PDIR3_P5                         *((volatile  uint8_t *)(0x42DE6194UL))
#define bFM4_GPIO_PDIR3_P5                        *((volatile  uint8_t *)(0x42DE6194UL))
#define bFM_GPIO_PDIR3_P6                         *((volatile  uint8_t *)(0x42DE6198UL))
#define bFM4_GPIO_PDIR3_P6                        *((volatile  uint8_t *)(0x42DE6198UL))
#define bFM_GPIO_PDIR3_P7                         *((volatile  uint8_t *)(0x42DE619CUL))
#define bFM4_GPIO_PDIR3_P7                        *((volatile  uint8_t *)(0x42DE619CUL))
#define bFM_GPIO_PDIR3_P8                         *((volatile  uint8_t *)(0x42DE61A0UL))
#define bFM4_GPIO_PDIR3_P8                        *((volatile  uint8_t *)(0x42DE61A0UL))
#define bFM_GPIO_PDIR3_P9                         *((volatile  uint8_t *)(0x42DE61A4UL))
#define bFM4_GPIO_PDIR3_P9                        *((volatile  uint8_t *)(0x42DE61A4UL))
#define bFM_GPIO_PDIR3_PA                         *((volatile  uint8_t *)(0x42DE61A8UL))
#define bFM4_GPIO_PDIR3_PA                        *((volatile  uint8_t *)(0x42DE61A8UL))
#define bFM_GPIO_PDIR3_PB                         *((volatile  uint8_t *)(0x42DE61ACUL))
#define bFM4_GPIO_PDIR3_PB                        *((volatile  uint8_t *)(0x42DE61ACUL))
#define bFM_GPIO_PDIR3_PC                         *((volatile  uint8_t *)(0x42DE61B0UL))
#define bFM4_GPIO_PDIR3_PC                        *((volatile  uint8_t *)(0x42DE61B0UL))
#define bFM_GPIO_PDIR3_PD                         *((volatile  uint8_t *)(0x42DE61B4UL))
#define bFM4_GPIO_PDIR3_PD                        *((volatile  uint8_t *)(0x42DE61B4UL))
#define bFM_GPIO_PDIR3_PE                         *((volatile  uint8_t *)(0x42DE61B8UL))
#define bFM4_GPIO_PDIR3_PE                        *((volatile  uint8_t *)(0x42DE61B8UL))

#define bFM_GPIO_PDIR4_P0                         *((volatile  uint8_t *)(0x42DE6200UL))
#define bFM4_GPIO_PDIR4_P0                        *((volatile  uint8_t *)(0x42DE6200UL))
#define bFM_GPIO_PDIR4_P1                         *((volatile  uint8_t *)(0x42DE6204UL))
#define bFM4_GPIO_PDIR4_P1                        *((volatile  uint8_t *)(0x42DE6204UL))
#define bFM_GPIO_PDIR4_P2                         *((volatile  uint8_t *)(0x42DE6208UL))
#define bFM4_GPIO_PDIR4_P2                        *((volatile  uint8_t *)(0x42DE6208UL))
#define bFM_GPIO_PDIR4_P3                         *((volatile  uint8_t *)(0x42DE620CUL))
#define bFM4_GPIO_PDIR4_P3                        *((volatile  uint8_t *)(0x42DE620CUL))
#define bFM_GPIO_PDIR4_P4                         *((volatile  uint8_t *)(0x42DE6210UL))
#define bFM4_GPIO_PDIR4_P4                        *((volatile  uint8_t *)(0x42DE6210UL))
#define bFM_GPIO_PDIR4_P5                         *((volatile  uint8_t *)(0x42DE6214UL))
#define bFM4_GPIO_PDIR4_P5                        *((volatile  uint8_t *)(0x42DE6214UL))
#define bFM_GPIO_PDIR4_P6                         *((volatile  uint8_t *)(0x42DE6218UL))
#define bFM4_GPIO_PDIR4_P6                        *((volatile  uint8_t *)(0x42DE6218UL))
#define bFM_GPIO_PDIR4_P7                         *((volatile  uint8_t *)(0x42DE621CUL))
#define bFM4_GPIO_PDIR4_P7                        *((volatile  uint8_t *)(0x42DE621CUL))
#define bFM_GPIO_PDIR4_P8                         *((volatile  uint8_t *)(0x42DE6220UL))
#define bFM4_GPIO_PDIR4_P8                        *((volatile  uint8_t *)(0x42DE6220UL))
#define bFM_GPIO_PDIR4_P9                         *((volatile  uint8_t *)(0x42DE6224UL))
#define bFM4_GPIO_PDIR4_P9                        *((volatile  uint8_t *)(0x42DE6224UL))
#define bFM_GPIO_PDIR4_PA                         *((volatile  uint8_t *)(0x42DE6228UL))
#define bFM4_GPIO_PDIR4_PA                        *((volatile  uint8_t *)(0x42DE6228UL))
#define bFM_GPIO_PDIR4_PB                         *((volatile  uint8_t *)(0x42DE622CUL))
#define bFM4_GPIO_PDIR4_PB                        *((volatile  uint8_t *)(0x42DE622CUL))
#define bFM_GPIO_PDIR4_PC                         *((volatile  uint8_t *)(0x42DE6230UL))
#define bFM4_GPIO_PDIR4_PC                        *((volatile  uint8_t *)(0x42DE6230UL))
#define bFM_GPIO_PDIR4_PD                         *((volatile  uint8_t *)(0x42DE6234UL))
#define bFM4_GPIO_PDIR4_PD                        *((volatile  uint8_t *)(0x42DE6234UL))
#define bFM_GPIO_PDIR4_PE                         *((volatile  uint8_t *)(0x42DE6238UL))
#define bFM4_GPIO_PDIR4_PE                        *((volatile  uint8_t *)(0x42DE6238UL))

