rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xl.h
#define bFM_GPIO_PDIR5_P0                         *((volatile  uint8_t *)(0x42DE6280UL))
#define bFM4_GPIO_PDIR5_P0                        *((volatile  uint8_t *)(0x42DE6280UL))
#define bFM_GPIO_PDIR5_P1                         *((volatile  uint8_t *)(0x42DE6284UL))
#define bFM4_GPIO_PDIR5_P1                        *((volatile  uint8_t *)(0x42DE6284UL))
#define bFM_GPIO_PDIR5_P2                         *((volatile  uint8_t *)(0x42DE6288UL))
#define bFM4_GPIO_PDIR5_P2                        *((volatile  uint8_t *)(0x42DE6288UL))
#define bFM_GPIO_PDIR5_P3                         *((volatile  uint8_t *)(0x42DE628CUL))
#define bFM4_GPIO_PDIR5_P3                        *((volatile  uint8_t *)(0x42DE628CUL))
#define bFM_GPIO_PDIR5_P4                         *((volatile  uint8_t *)(0x42DE6290UL))
#define bFM4_GPIO_PDIR5_P4                        *((volatile  uint8_t *)(0x42DE6290UL))
#define bFM_GPIO_PDIR5_P5                         *((volatile  uint8_t *)(0x42DE6294UL))
#define bFM4_GPIO_PDIR5_P5                        *((volatile  uint8_t *)(0x42DE6294UL))
#define bFM_GPIO_PDIR5_P6                         *((volatile  uint8_t *)(0x42DE6298UL))
#define bFM4_GPIO_PDIR5_P6                        *((volatile  uint8_t *)(0x42DE6298UL))
#define bFM_GPIO_PDIR5_P7                         *((volatile  uint8_t *)(0x42DE629CUL))
#define bFM4_GPIO_PDIR5_P7                        *((volatile  uint8_t *)(0x42DE629CUL))
#define bFM_GPIO_PDIR5_P8                         *((volatile  uint8_t *)(0x42DE62A0UL))
#define bFM4_GPIO_PDIR5_P8                        *((volatile  uint8_t *)(0x42DE62A0UL))
#define bFM_GPIO_PDIR5_P9                         *((volatile  uint8_t *)(0x42DE62A4UL))
#define bFM4_GPIO_PDIR5_P9                        *((volatile  uint8_t *)(0x42DE62A4UL))
#define bFM_GPIO_PDIR5_PA                         *((volatile  uint8_t *)(0x42DE62A8UL))
#define bFM4_GPIO_PDIR5_PA                        *((volatile  uint8_t *)(0x42DE62A8UL))
#define bFM_GPIO_PDIR5_PB                         *((volatile  uint8_t *)(0x42DE62ACUL))
#define bFM4_GPIO_PDIR5_PB                        *((volatile  uint8_t *)(0x42DE62ACUL))
#define bFM_GPIO_PDIR5_PC                         *((volatile  uint8_t *)(0x42DE62B0UL))
#define bFM4_GPIO_PDIR5_PC                        *((volatile  uint8_t *)(0x42DE62B0UL))
#define bFM_GPIO_PDIR5_PD                         *((volatile  uint8_t *)(0x42DE62B4UL))
#define bFM4_GPIO_PDIR5_PD                        *((volatile  uint8_t *)(0x42DE62B4UL))
#define bFM_GPIO_PDIR5_PE                         *((volatile  uint8_t *)(0x42DE62B8UL))
#define bFM4_GPIO_PDIR5_PE                        *((volatile  uint8_t *)(0x42DE62B8UL))
#define bFM_GPIO_PDIR5_PF                         *((volatile  uint8_t *)(0x42DE62BCUL))
#define bFM4_GPIO_PDIR5_PF                        *((volatile  uint8_t *)(0x42DE62BCUL))

#define bFM_GPIO_PDIR6_P0                         *((volatile  uint8_t *)(0x42DE6300UL))
#define bFM4_GPIO_PDIR6_P0                        *((volatile  uint8_t *)(0x42DE6300UL))
#define bFM_GPIO_PDIR6_P1                         *((volatile  uint8_t *)(0x42DE6304UL))
#define bFM4_GPIO_PDIR6_P1                        *((volatile  uint8_t *)(0x42DE6304UL))
#define bFM_GPIO_PDIR6_P2                         *((volatile  uint8_t *)(0x42DE6308UL))
#define bFM4_GPIO_PDIR6_P2                        *((volatile  uint8_t *)(0x42DE6308UL))
#define bFM_GPIO_PDIR6_P3                         *((volatile  uint8_t *)(0x42DE630CUL))
#define bFM4_GPIO_PDIR6_P3                        *((volatile  uint8_t *)(0x42DE630CUL))
#define bFM_GPIO_PDIR6_P4                         *((volatile  uint8_t *)(0x42DE6310UL))
#define bFM4_GPIO_PDIR6_P4                        *((volatile  uint8_t *)(0x42DE6310UL))
#define bFM_GPIO_PDIR6_P5                         *((volatile  uint8_t *)(0x42DE6314UL))
#define bFM4_GPIO_PDIR6_P5                        *((volatile  uint8_t *)(0x42DE6314UL))
#define bFM_GPIO_PDIR6_P6                         *((volatile  uint8_t *)(0x42DE6318UL))
#define bFM4_GPIO_PDIR6_P6                        *((volatile  uint8_t *)(0x42DE6318UL))
#define bFM_GPIO_PDIR6_P7                         *((volatile  uint8_t *)(0x42DE631CUL))
#define bFM4_GPIO_PDIR6_P7                        *((volatile  uint8_t *)(0x42DE631CUL))
#define bFM_GPIO_PDIR6_P8                         *((volatile  uint8_t *)(0x42DE6320UL))
#define bFM4_GPIO_PDIR6_P8                        *((volatile  uint8_t *)(0x42DE6320UL))
#define bFM_GPIO_PDIR6_P9                         *((volatile  uint8_t *)(0x42DE6324UL))
#define bFM4_GPIO_PDIR6_P9                        *((volatile  uint8_t *)(0x42DE6324UL))
#define bFM_GPIO_PDIR6_PA                         *((volatile  uint8_t *)(0x42DE6328UL))
#define bFM4_GPIO_PDIR6_PA                        *((volatile  uint8_t *)(0x42DE6328UL))
#define bFM_GPIO_PDIR6_PB                         *((volatile  uint8_t *)(0x42DE632CUL))
#define bFM4_GPIO_PDIR6_PB                        *((volatile  uint8_t *)(0x42DE632CUL))
#define bFM_GPIO_PDIR6_PC                         *((volatile  uint8_t *)(0x42DE6330UL))
#define bFM4_GPIO_PDIR6_PC                        *((volatile  uint8_t *)(0x42DE6330UL))
#define bFM_GPIO_PDIR6_PD                         *((volatile  uint8_t *)(0x42DE6334UL))
#define bFM4_GPIO_PDIR6_PD                        *((volatile  uint8_t *)(0x42DE6334UL))
#define bFM_GPIO_PDIR6_PE                         *((volatile  uint8_t *)(0x42DE6338UL))
#define bFM4_GPIO_PDIR6_PE                        *((volatile  uint8_t *)(0x42DE6338UL))

#define bFM_GPIO_PDIR7_P0                         *((volatile  uint8_t *)(0x42DE6380UL))
#define bFM4_GPIO_PDIR7_P0                        *((volatile  uint8_t *)(0x42DE6380UL))
#define bFM_GPIO_PDIR7_P1                         *((volatile  uint8_t *)(0x42DE6384UL))
#define bFM4_GPIO_PDIR7_P1                        *((volatile  uint8_t *)(0x42DE6384UL))
#define bFM_GPIO_PDIR7_P2                         *((volatile  uint8_t *)(0x42DE6388UL))
#define bFM4_GPIO_PDIR7_P2                        *((volatile  uint8_t *)(0x42DE6388UL))
#define bFM_GPIO_PDIR7_P3                         *((volatile  uint8_t *)(0x42DE638CUL))
#define bFM4_GPIO_PDIR7_P3                        *((volatile  uint8_t *)(0x42DE638CUL))
#define bFM_GPIO_PDIR7_P4                         *((volatile  uint8_t *)(0x42DE6390UL))
#define bFM4_GPIO_PDIR7_P4                        *((volatile  uint8_t *)(0x42DE6390UL))
#define bFM_GPIO_PDIR7_P5                         *((volatile  uint8_t *)(0x42DE6394UL))
#define bFM4_GPIO_PDIR7_P5                        *((volatile  uint8_t *)(0x42DE6394UL))
#define bFM_GPIO_PDIR7_P6                         *((volatile  uint8_t *)(0x42DE6398UL))
#define bFM4_GPIO_PDIR7_P6                        *((volatile  uint8_t *)(0x42DE6398UL))
#define bFM_GPIO_PDIR7_P7                         *((volatile  uint8_t *)(0x42DE639CUL))
#define bFM4_GPIO_PDIR7_P7                        *((volatile  uint8_t *)(0x42DE639CUL))
#define bFM_GPIO_PDIR7_P8                         *((volatile  uint8_t *)(0x42DE63A0UL))
#define bFM4_GPIO_PDIR7_P8                        *((volatile  uint8_t *)(0x42DE63A0UL))
#define bFM_GPIO_PDIR7_P9                         *((volatile  uint8_t *)(0x42DE63A4UL))
#define bFM4_GPIO_PDIR7_P9                        *((volatile  uint8_t *)(0x42DE63A4UL))
#define bFM_GPIO_PDIR7_PA                         *((volatile  uint8_t *)(0x42DE63A8UL))
#define bFM4_GPIO_PDIR7_PA                        *((volatile  uint8_t *)(0x42DE63A8UL))
#define bFM_GPIO_PDIR7_PB                         *((volatile  uint8_t *)(0x42DE63ACUL))
#define bFM4_GPIO_PDIR7_PB                        *((volatile  uint8_t *)(0x42DE63ACUL))
#define bFM_GPIO_PDIR7_PC                         *((volatile  uint8_t *)(0x42DE63B0UL))
#define bFM4_GPIO_PDIR7_PC                        *((volatile  uint8_t *)(0x42DE63B0UL))
#define bFM_GPIO_PDIR7_PD                         *((volatile  uint8_t *)(0x42DE63B4UL))
#define bFM4_GPIO_PDIR7_PD                        *((volatile  uint8_t *)(0x42DE63B4UL))
#define bFM_GPIO_PDIR7_PE                         *((volatile  uint8_t *)(0x42DE63B8UL))
#define bFM4_GPIO_PDIR7_PE                        *((volatile  uint8_t *)(0x42DE63B8UL))

#define bFM_GPIO_PDIR8_P0                         *((volatile  uint8_t *)(0x42DE6400UL))
#define bFM4_GPIO_PDIR8_P0                        *((volatile  uint8_t *)(0x42DE6400UL))
#define bFM_GPIO_PDIR8_P1                         *((volatile  uint8_t *)(0x42DE6404UL))
#define bFM4_GPIO_PDIR8_P1                        *((volatile  uint8_t *)(0x42DE6404UL))
#define bFM_GPIO_PDIR8_P2                         *((volatile  uint8_t *)(0x42DE6408UL))
#define bFM4_GPIO_PDIR8_P2                        *((volatile  uint8_t *)(0x42DE6408UL))
#define bFM_GPIO_PDIR8_P3                         *((volatile  uint8_t *)(0x42DE640CUL))
#define bFM4_GPIO_PDIR8_P3                        *((volatile  uint8_t *)(0x42DE640CUL))

#define bFM_GPIO_PDIR9_P0                         *((volatile  uint8_t *)(0x42DE6480UL))
#define bFM4_GPIO_PDIR9_P0                        *((volatile  uint8_t *)(0x42DE6480UL))
#define bFM_GPIO_PDIR9_P1                         *((volatile  uint8_t *)(0x42DE6484UL))
#define bFM4_GPIO_PDIR9_P1                        *((volatile  uint8_t *)(0x42DE6484UL))
#define bFM_GPIO_PDIR9_P2                         *((volatile  uint8_t *)(0x42DE6488UL))
#define bFM4_GPIO_PDIR9_P2                        *((volatile  uint8_t *)(0x42DE6488UL))
#define bFM_GPIO_PDIR9_P3                         *((volatile  uint8_t *)(0x42DE648CUL))
#define bFM4_GPIO_PDIR9_P3                        *((volatile  uint8_t *)(0x42DE648CUL))
#define bFM_GPIO_PDIR9_P4                         *((volatile  uint8_t *)(0x42DE6490UL))
#define bFM4_GPIO_PDIR9_P4                        *((volatile  uint8_t *)(0x42DE6490UL))
#define bFM_GPIO_PDIR9_P5                         *((volatile  uint8_t *)(0x42DE6494UL))
#define bFM4_GPIO_PDIR9_P5                        *((volatile  uint8_t *)(0x42DE6494UL))
#define bFM_GPIO_PDIR9_P6                         *((volatile  uint8_t *)(0x42DE6498UL))
#define bFM4_GPIO_PDIR9_P6                        *((volatile  uint8_t *)(0x42DE6498UL))
#define bFM_GPIO_PDIR9_P7                         *((volatile  uint8_t *)(0x42DE649CUL))
#define bFM4_GPIO_PDIR9_P7                        *((volatile  uint8_t *)(0x42DE649CUL))

#define bFM_GPIO_PDIRA_P0                         *((volatile  uint8_t *)(0x42DE6500UL))
#define bFM4_GPIO_PDIRA_P0                        *((volatile  uint8_t *)(0x42DE6500UL))
#define bFM_GPIO_PDIRA_P1                         *((volatile  uint8_t *)(0x42DE6504UL))
#define bFM4_GPIO_PDIRA_P1                        *((volatile  uint8_t *)(0x42DE6504UL))
#define bFM_GPIO_PDIRA_P2                         *((volatile  uint8_t *)(0x42DE6508UL))
#define bFM4_GPIO_PDIRA_P2                        *((volatile  uint8_t *)(0x42DE6508UL))
#define bFM_GPIO_PDIRA_P3                         *((volatile  uint8_t *)(0x42DE650CUL))
#define bFM4_GPIO_PDIRA_P3                        *((volatile  uint8_t *)(0x42DE650CUL))
#define bFM_GPIO_PDIRA_P4                         *((volatile  uint8_t *)(0x42DE6510UL))
#define bFM4_GPIO_PDIRA_P4                        *((volatile  uint8_t *)(0x42DE6510UL))
#define bFM_GPIO_PDIRA_P5                         *((volatile  uint8_t *)(0x42DE6514UL))
#define bFM4_GPIO_PDIRA_P5                        *((volatile  uint8_t *)(0x42DE6514UL))
#define bFM_GPIO_PDIRA_P6                         *((volatile  uint8_t *)(0x42DE6518UL))
#define bFM4_GPIO_PDIRA_P6                        *((volatile  uint8_t *)(0x42DE6518UL))
#define bFM_GPIO_PDIRA_P7                         *((volatile  uint8_t *)(0x42DE651CUL))
#define bFM4_GPIO_PDIRA_P7                        *((volatile  uint8_t *)(0x42DE651CUL))
#define bFM_GPIO_PDIRA_P8                         *((volatile  uint8_t *)(0x42DE6520UL))
#define bFM4_GPIO_PDIRA_P8                        *((volatile  uint8_t *)(0x42DE6520UL))
#define bFM_GPIO_PDIRA_P9                         *((volatile  uint8_t *)(0x42DE6524UL))
#define bFM4_GPIO_PDIRA_P9                        *((volatile  uint8_t *)(0x42DE6524UL))
#define bFM_GPIO_PDIRA_PA                         *((volatile  uint8_t *)(0x42DE6528UL))
#define bFM4_GPIO_PDIRA_PA                        *((volatile  uint8_t *)(0x42DE6528UL))
#define bFM_GPIO_PDIRA_PB                         *((volatile  uint8_t *)(0x42DE652CUL))
#define bFM4_GPIO_PDIRA_PB                        *((volatile  uint8_t *)(0x42DE652CUL))
#define bFM_GPIO_PDIRA_PC                         *((volatile  uint8_t *)(0x42DE6530UL))
#define bFM4_GPIO_PDIRA_PC                        *((volatile  uint8_t *)(0x42DE6530UL))
#define bFM_GPIO_PDIRA_PD                         *((volatile  uint8_t *)(0x42DE6534UL))
#define bFM4_GPIO_PDIRA_PD                        *((volatile  uint8_t *)(0x42DE6534UL))
#define bFM_GPIO_PDIRA_PE                         *((volatile  uint8_t *)(0x42DE6538UL))
#define bFM4_GPIO_PDIRA_PE                        *((volatile  uint8_t *)(0x42DE6538UL))
#define bFM_GPIO_PDIRA_PF                         *((volatile  uint8_t *)(0x42DE653CUL))
#define bFM4_GPIO_PDIRA_PF                        *((volatile  uint8_t *)(0x42DE653CUL))

#define bFM_GPIO_PDIRB_P0                         *((volatile  uint8_t *)(0x42DE6580UL))
#define bFM4_GPIO_PDIRB_P0                        *((volatile  uint8_t *)(0x42DE6580UL))
#define bFM_GPIO_PDIRB_P1                         *((volatile  uint8_t *)(0x42DE6584UL))
#define bFM4_GPIO_PDIRB_P1                        *((volatile  uint8_t *)(0x42DE6584UL))
#define bFM_GPIO_PDIRB_P2                         *((volatile  uint8_t *)(0x42DE6588UL))
#define bFM4_GPIO_PDIRB_P2                        *((volatile  uint8_t *)(0x42DE6588UL))
#define bFM_GPIO_PDIRB_P3                         *((volatile  uint8_t *)(0x42DE658CUL))
#define bFM4_GPIO_PDIRB_P3                        *((volatile  uint8_t *)(0x42DE658CUL))
#define bFM_GPIO_PDIRB_P4                         *((volatile  uint8_t *)(0x42DE6590UL))
#define bFM4_GPIO_PDIRB_P4                        *((volatile  uint8_t *)(0x42DE6590UL))
#define bFM_GPIO_PDIRB_P5                         *((volatile  uint8_t *)(0x42DE6594UL))
#define bFM4_GPIO_PDIRB_P5                        *((volatile  uint8_t *)(0x42DE6594UL))
#define bFM_GPIO_PDIRB_P6                         *((volatile  uint8_t *)(0x42DE6598UL))
#define bFM4_GPIO_PDIRB_P6                        *((volatile  uint8_t *)(0x42DE6598UL))
#define bFM_GPIO_PDIRB_P7                         *((volatile  uint8_t *)(0x42DE659CUL))
#define bFM4_GPIO_PDIRB_P7                        *((volatile  uint8_t *)(0x42DE659CUL))
#define bFM_GPIO_PDIRB_P8                         *((volatile  uint8_t *)(0x42DE65A0UL))
#define bFM4_GPIO_PDIRB_P8                        *((volatile  uint8_t *)(0x42DE65A0UL))
#define bFM_GPIO_PDIRB_P9                         *((volatile  uint8_t *)(0x42DE65A4UL))
#define bFM4_GPIO_PDIRB_P9                        *((volatile  uint8_t *)(0x42DE65A4UL))
#define bFM_GPIO_PDIRB_PA                         *((volatile  uint8_t *)(0x42DE65A8UL))
#define bFM4_GPIO_PDIRB_PA                        *((volatile  uint8_t *)(0x42DE65A8UL))
#define bFM_GPIO_PDIRB_PB                         *((volatile  uint8_t *)(0x42DE65ACUL))
#define bFM4_GPIO_PDIRB_PB                        *((volatile  uint8_t *)(0x42DE65ACUL))
#define bFM_GPIO_PDIRB_PC                         *((volatile  uint8_t *)(0x42DE65B0UL))
#define bFM4_GPIO_PDIRB_PC                        *((volatile  uint8_t *)(0x42DE65B0UL))
#define bFM_GPIO_PDIRB_PD                         *((volatile  uint8_t *)(0x42DE65B4UL))
#define bFM4_GPIO_PDIRB_PD                        *((volatile  uint8_t *)(0x42DE65B4UL))
#define bFM_GPIO_PDIRB_PE                         *((volatile  uint8_t *)(0x42DE65B8UL))
#define bFM4_GPIO_PDIRB_PE                        *((volatile  uint8_t *)(0x42DE65B8UL))
#define bFM_GPIO_PDIRB_PF                         *((volatile  uint8_t *)(0x42DE65BCUL))
#define bFM4_GPIO_PDIRB_PF                        *((volatile  uint8_t *)(0x42DE65BCUL))

#define bFM_GPIO_PDIRC_P0                         *((volatile  uint8_t *)(0x42DE6600UL))
#define bFM4_GPIO_PDIRC_P0                        *((volatile  uint8_t *)(0x42DE6600UL))
#define bFM_GPIO_PDIRC_P1                         *((volatile  uint8_t *)(0x42DE6604UL))
#define bFM4_GPIO_PDIRC_P1                        *((volatile  uint8_t *)(0x42DE6604UL))
#define bFM_GPIO_PDIRC_P2                         *((volatile  uint8_t *)(0x42DE6608UL))
#define bFM4_GPIO_PDIRC_P2                        *((volatile  uint8_t *)(0x42DE6608UL))
#define bFM_GPIO_PDIRC_P3                         *((volatile  uint8_t *)(0x42DE660CUL))
#define bFM4_GPIO_PDIRC_P3                        *((volatile  uint8_t *)(0x42DE660CUL))
#define bFM_GPIO_PDIRC_P4                         *((volatile  uint8_t *)(0x42DE6610UL))
#define bFM4_GPIO_PDIRC_P4                        *((volatile  uint8_t *)(0x42DE6610UL))
#define bFM_GPIO_PDIRC_P5                         *((volatile  uint8_t *)(0x42DE6614UL))
#define bFM4_GPIO_PDIRC_P5                        *((volatile  uint8_t *)(0x42DE6614UL))
#define bFM_GPIO_PDIRC_P6                         *((volatile  uint8_t *)(0x42DE6618UL))
#define bFM4_GPIO_PDIRC_P6                        *((volatile  uint8_t *)(0x42DE6618UL))
#define bFM_GPIO_PDIRC_P7                         *((volatile  uint8_t *)(0x42DE661CUL))
#define bFM4_GPIO_PDIRC_P7                        *((volatile  uint8_t *)(0x42DE661CUL))
#define bFM_GPIO_PDIRC_P8                         *((volatile  uint8_t *)(0x42DE6620UL))
#define bFM4_GPIO_PDIRC_P8                        *((volatile  uint8_t *)(0x42DE6620UL))
#define bFM_GPIO_PDIRC_P9                         *((volatile  uint8_t *)(0x42DE6624UL))
#define bFM4_GPIO_PDIRC_P9                        *((volatile  uint8_t *)(0x42DE6624UL))
#define bFM_GPIO_PDIRC_PA                         *((volatile  uint8_t *)(0x42DE6628UL))
#define bFM4_GPIO_PDIRC_PA                        *((volatile  uint8_t *)(0x42DE6628UL))
#define bFM_GPIO_PDIRC_PB                         *((volatile  uint8_t *)(0x42DE662CUL))
#define bFM4_GPIO_PDIRC_PB                        *((volatile  uint8_t *)(0x42DE662CUL))
#define bFM_GPIO_PDIRC_PC                         *((volatile  uint8_t *)(0x42DE6630UL))
#define bFM4_GPIO_PDIRC_PC                        *((volatile  uint8_t *)(0x42DE6630UL))
#define bFM_GPIO_PDIRC_PD                         *((volatile  uint8_t *)(0x42DE6634UL))
#define bFM4_GPIO_PDIRC_PD                        *((volatile  uint8_t *)(0x42DE6634UL))
#define bFM_GPIO_PDIRC_PE                         *((volatile  uint8_t *)(0x42DE6638UL))
#define bFM4_GPIO_PDIRC_PE                        *((volatile  uint8_t *)(0x42DE6638UL))
#define bFM_GPIO_PDIRC_PF                         *((volatile  uint8_t *)(0x42DE663CUL))
#define bFM4_GPIO_PDIRC_PF                        *((volatile  uint8_t *)(0x42DE663CUL))

#define bFM_GPIO_PDIRD_P0                         *((volatile  uint8_t *)(0x42DE6680UL))
#define bFM4_GPIO_PDIRD_P0                        *((volatile  uint8_t *)(0x42DE6680UL))
#define bFM_GPIO_PDIRD_P1                         *((volatile  uint8_t *)(0x42DE6684UL))
#define bFM4_GPIO_PDIRD_P1                        *((volatile  uint8_t *)(0x42DE6684UL))
#define bFM_GPIO_PDIRD_P2                         *((volatile  uint8_t *)(0x42DE6688UL))
#define bFM4_GPIO_PDIRD_P2                        *((volatile  uint8_t *)(0x42DE6688UL))

#define bFM_GPIO_PDIRE_P0                         *((volatile  uint8_t *)(0x42DE6700UL))
#define bFM4_GPIO_PDIRE_P0                        *((volatile  uint8_t *)(0x42DE6700UL))
#define bFM_GPIO_PDIRE_P2                         *((volatile  uint8_t *)(0x42DE6708UL))
#define bFM4_GPIO_PDIRE_P2                        *((volatile  uint8_t *)(0x42DE6708UL))
#define bFM_GPIO_PDIRE_P3                         *((volatile  uint8_t *)(0x42DE670CUL))
#define bFM4_GPIO_PDIRE_P3                        *((volatile  uint8_t *)(0x42DE670CUL))

#define bFM_GPIO_PDIRF_P0                         *((volatile  uint8_t *)(0x42DE6780UL))
#define bFM4_GPIO_PDIRF_P0                        *((volatile  uint8_t *)(0x42DE6780UL))
#define bFM_GPIO_PDIRF_P1                         *((volatile  uint8_t *)(0x42DE6784UL))
#define bFM4_GPIO_PDIRF_P1                        *((volatile  uint8_t *)(0x42DE6784UL))
#define bFM_GPIO_PDIRF_P2                         *((volatile  uint8_t *)(0x42DE6788UL))
#define bFM4_GPIO_PDIRF_P2                        *((volatile  uint8_t *)(0x42DE6788UL))
#define bFM_GPIO_PDIRF_P3                         *((volatile  uint8_t *)(0x42DE678CUL))
#define bFM4_GPIO_PDIRF_P3                        *((volatile  uint8_t *)(0x42DE678CUL))
#define bFM_GPIO_PDIRF_P4                         *((volatile  uint8_t *)(0x42DE6790UL))
#define bFM4_GPIO_PDIRF_P4                        *((volatile  uint8_t *)(0x42DE6790UL))
#define bFM_GPIO_PDIRF_P5                         *((volatile  uint8_t *)(0x42DE6794UL))
#define bFM4_GPIO_PDIRF_P5                        *((volatile  uint8_t *)(0x42DE6794UL))
#define bFM_GPIO_PDIRF_P6                         *((volatile  uint8_t *)(0x42DE6798UL))
#define bFM4_GPIO_PDIRF_P6                        *((volatile  uint8_t *)(0x42DE6798UL))
#define bFM_GPIO_PDIRF_P7                         *((volatile  uint8_t *)(0x42DE679CUL))
#define bFM4_GPIO_PDIRF_P7                        *((volatile  uint8_t *)(0x42DE679CUL))
#define bFM_GPIO_PDIRF_P8                         *((volatile  uint8_t *)(0x42DE67A0UL))
#define bFM4_GPIO_PDIRF_P8                        *((volatile  uint8_t *)(0x42DE67A0UL))
#define bFM_GPIO_PDIRF_P9                         *((volatile  uint8_t *)(0x42DE67A4UL))
#define bFM4_GPIO_PDIRF_P9                        *((volatile  uint8_t *)(0x42DE67A4UL))
#define bFM_GPIO_PDIRF_PA                         *((volatile  uint8_t *)(0x42DE67A8UL))
#define bFM4_GPIO_PDIRF_PA                        *((volatile  uint8_t *)(0x42DE67A8UL))
#define bFM_GPIO_PDIRF_PB                         *((volatile  uint8_t *)(0x42DE67ACUL))
#define bFM4_GPIO_PDIRF_PB                        *((volatile  uint8_t *)(0x42DE67ACUL))
#define bFM_GPIO_PDIRF_PC                         *((volatile  uint8_t *)(0x42DE67B0UL))
#define bFM4_GPIO_PDIRF_PC                        *((volatile  uint8_t *)(0x42DE67B0UL))

#define bFM_GPIO_PDOR0_P0                         *((volatile  uint8_t *)(0x42DE8000UL))
#define bFM4_GPIO_PDOR0_P0                        *((volatile  uint8_t *)(0x42DE8000UL))
#define bFM_GPIO_PDOR0_P1                         *((volatile  uint8_t *)(0x42DE8004UL))
#define bFM4_GPIO_PDOR0_P1                        *((volatile  uint8_t *)(0x42DE8004UL))
#define bFM_GPIO_PDOR0_P2                         *((volatile  uint8_t *)(0x42DE8008UL))
#define bFM4_GPIO_PDOR0_P2                        *((volatile  uint8_t *)(0x42DE8008UL))
#define bFM_GPIO_PDOR0_P3                         *((volatile  uint8_t *)(0x42DE800CUL))
#define bFM4_GPIO_PDOR0_P3                        *((volatile  uint8_t *)(0x42DE800CUL))
#define bFM_GPIO_PDOR0_P4                         *((volatile  uint8_t *)(0x42DE8010UL))
#define bFM4_GPIO_PDOR0_P4                        *((volatile  uint8_t *)(0x42DE8010UL))
#define bFM_GPIO_PDOR0_P8                         *((volatile  uint8_t *)(0x42DE8020UL))
#define bFM4_GPIO_PDOR0_P8                        *((volatile  uint8_t *)(0x42DE8020UL))
#define bFM_GPIO_PDOR0_P9                         *((volatile  uint8_t *)(0x42DE8024UL))
#define bFM4_GPIO_PDOR0_P9                        *((volatile  uint8_t *)(0x42DE8024UL))
#define bFM_GPIO_PDOR0_PA                         *((volatile  uint8_t *)(0x42DE8028UL))
#define bFM4_GPIO_PDOR0_PA                        *((volatile  uint8_t *)(0x42DE8028UL))

