rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xl.h
#define bFM_GPIO_PDORB_P0                         *((volatile  uint8_t *)(0x42DE8580UL))
#define bFM4_GPIO_PDORB_P0                        *((volatile  uint8_t *)(0x42DE8580UL))
#define bFM_GPIO_PDORB_P1                         *((volatile  uint8_t *)(0x42DE8584UL))
#define bFM4_GPIO_PDORB_P1                        *((volatile  uint8_t *)(0x42DE8584UL))
#define bFM_GPIO_PDORB_P2                         *((volatile  uint8_t *)(0x42DE8588UL))
#define bFM4_GPIO_PDORB_P2                        *((volatile  uint8_t *)(0x42DE8588UL))
#define bFM_GPIO_PDORB_P3                         *((volatile  uint8_t *)(0x42DE858CUL))
#define bFM4_GPIO_PDORB_P3                        *((volatile  uint8_t *)(0x42DE858CUL))
#define bFM_GPIO_PDORB_P4                         *((volatile  uint8_t *)(0x42DE8590UL))
#define bFM4_GPIO_PDORB_P4                        *((volatile  uint8_t *)(0x42DE8590UL))
#define bFM_GPIO_PDORB_P5                         *((volatile  uint8_t *)(0x42DE8594UL))
#define bFM4_GPIO_PDORB_P5                        *((volatile  uint8_t *)(0x42DE8594UL))
#define bFM_GPIO_PDORB_P6                         *((volatile  uint8_t *)(0x42DE8598UL))
#define bFM4_GPIO_PDORB_P6                        *((volatile  uint8_t *)(0x42DE8598UL))
#define bFM_GPIO_PDORB_P7                         *((volatile  uint8_t *)(0x42DE859CUL))
#define bFM4_GPIO_PDORB_P7                        *((volatile  uint8_t *)(0x42DE859CUL))
#define bFM_GPIO_PDORB_P8                         *((volatile  uint8_t *)(0x42DE85A0UL))
#define bFM4_GPIO_PDORB_P8                        *((volatile  uint8_t *)(0x42DE85A0UL))
#define bFM_GPIO_PDORB_P9                         *((volatile  uint8_t *)(0x42DE85A4UL))
#define bFM4_GPIO_PDORB_P9                        *((volatile  uint8_t *)(0x42DE85A4UL))
#define bFM_GPIO_PDORB_PA                         *((volatile  uint8_t *)(0x42DE85A8UL))
#define bFM4_GPIO_PDORB_PA                        *((volatile  uint8_t *)(0x42DE85A8UL))
#define bFM_GPIO_PDORB_PB                         *((volatile  uint8_t *)(0x42DE85ACUL))
#define bFM4_GPIO_PDORB_PB                        *((volatile  uint8_t *)(0x42DE85ACUL))
#define bFM_GPIO_PDORB_PC                         *((volatile  uint8_t *)(0x42DE85B0UL))
#define bFM4_GPIO_PDORB_PC                        *((volatile  uint8_t *)(0x42DE85B0UL))
#define bFM_GPIO_PDORB_PD                         *((volatile  uint8_t *)(0x42DE85B4UL))
#define bFM4_GPIO_PDORB_PD                        *((volatile  uint8_t *)(0x42DE85B4UL))
#define bFM_GPIO_PDORB_PE                         *((volatile  uint8_t *)(0x42DE85B8UL))
#define bFM4_GPIO_PDORB_PE                        *((volatile  uint8_t *)(0x42DE85B8UL))
#define bFM_GPIO_PDORB_PF                         *((volatile  uint8_t *)(0x42DE85BCUL))
#define bFM4_GPIO_PDORB_PF                        *((volatile  uint8_t *)(0x42DE85BCUL))

#define bFM_GPIO_PDORC_P0                         *((volatile  uint8_t *)(0x42DE8600UL))
#define bFM4_GPIO_PDORC_P0                        *((volatile  uint8_t *)(0x42DE8600UL))
#define bFM_GPIO_PDORC_P1                         *((volatile  uint8_t *)(0x42DE8604UL))
#define bFM4_GPIO_PDORC_P1                        *((volatile  uint8_t *)(0x42DE8604UL))
#define bFM_GPIO_PDORC_P2                         *((volatile  uint8_t *)(0x42DE8608UL))
#define bFM4_GPIO_PDORC_P2                        *((volatile  uint8_t *)(0x42DE8608UL))
#define bFM_GPIO_PDORC_P3                         *((volatile  uint8_t *)(0x42DE860CUL))
#define bFM4_GPIO_PDORC_P3                        *((volatile  uint8_t *)(0x42DE860CUL))
#define bFM_GPIO_PDORC_P4                         *((volatile  uint8_t *)(0x42DE8610UL))
#define bFM4_GPIO_PDORC_P4                        *((volatile  uint8_t *)(0x42DE8610UL))
#define bFM_GPIO_PDORC_P5                         *((volatile  uint8_t *)(0x42DE8614UL))
#define bFM4_GPIO_PDORC_P5                        *((volatile  uint8_t *)(0x42DE8614UL))
#define bFM_GPIO_PDORC_P6                         *((volatile  uint8_t *)(0x42DE8618UL))
#define bFM4_GPIO_PDORC_P6                        *((volatile  uint8_t *)(0x42DE8618UL))
#define bFM_GPIO_PDORC_P7                         *((volatile  uint8_t *)(0x42DE861CUL))
#define bFM4_GPIO_PDORC_P7                        *((volatile  uint8_t *)(0x42DE861CUL))
#define bFM_GPIO_PDORC_P8                         *((volatile  uint8_t *)(0x42DE8620UL))
#define bFM4_GPIO_PDORC_P8                        *((volatile  uint8_t *)(0x42DE8620UL))
#define bFM_GPIO_PDORC_P9                         *((volatile  uint8_t *)(0x42DE8624UL))
#define bFM4_GPIO_PDORC_P9                        *((volatile  uint8_t *)(0x42DE8624UL))
#define bFM_GPIO_PDORC_PA                         *((volatile  uint8_t *)(0x42DE8628UL))
#define bFM4_GPIO_PDORC_PA                        *((volatile  uint8_t *)(0x42DE8628UL))
#define bFM_GPIO_PDORC_PB                         *((volatile  uint8_t *)(0x42DE862CUL))
#define bFM4_GPIO_PDORC_PB                        *((volatile  uint8_t *)(0x42DE862CUL))
#define bFM_GPIO_PDORC_PC                         *((volatile  uint8_t *)(0x42DE8630UL))
#define bFM4_GPIO_PDORC_PC                        *((volatile  uint8_t *)(0x42DE8630UL))
#define bFM_GPIO_PDORC_PD                         *((volatile  uint8_t *)(0x42DE8634UL))
#define bFM4_GPIO_PDORC_PD                        *((volatile  uint8_t *)(0x42DE8634UL))
#define bFM_GPIO_PDORC_PE                         *((volatile  uint8_t *)(0x42DE8638UL))
#define bFM4_GPIO_PDORC_PE                        *((volatile  uint8_t *)(0x42DE8638UL))
#define bFM_GPIO_PDORC_PF                         *((volatile  uint8_t *)(0x42DE863CUL))
#define bFM4_GPIO_PDORC_PF                        *((volatile  uint8_t *)(0x42DE863CUL))

#define bFM_GPIO_PDORD_P0                         *((volatile  uint8_t *)(0x42DE8680UL))
#define bFM4_GPIO_PDORD_P0                        *((volatile  uint8_t *)(0x42DE8680UL))
#define bFM_GPIO_PDORD_P1                         *((volatile  uint8_t *)(0x42DE8684UL))
#define bFM4_GPIO_PDORD_P1                        *((volatile  uint8_t *)(0x42DE8684UL))
#define bFM_GPIO_PDORD_P2                         *((volatile  uint8_t *)(0x42DE8688UL))
#define bFM4_GPIO_PDORD_P2                        *((volatile  uint8_t *)(0x42DE8688UL))

#define bFM_GPIO_PDORE_P0                         *((volatile  uint8_t *)(0x42DE8700UL))
#define bFM4_GPIO_PDORE_P0                        *((volatile  uint8_t *)(0x42DE8700UL))
#define bFM_GPIO_PDORE_P2                         *((volatile  uint8_t *)(0x42DE8708UL))
#define bFM4_GPIO_PDORE_P2                        *((volatile  uint8_t *)(0x42DE8708UL))
#define bFM_GPIO_PDORE_P3                         *((volatile  uint8_t *)(0x42DE870CUL))
#define bFM4_GPIO_PDORE_P3                        *((volatile  uint8_t *)(0x42DE870CUL))

#define bFM_GPIO_PDORF_P0                         *((volatile  uint8_t *)(0x42DE8780UL))
#define bFM4_GPIO_PDORF_P0                        *((volatile  uint8_t *)(0x42DE8780UL))
#define bFM_GPIO_PDORF_P1                         *((volatile  uint8_t *)(0x42DE8784UL))
#define bFM4_GPIO_PDORF_P1                        *((volatile  uint8_t *)(0x42DE8784UL))
#define bFM_GPIO_PDORF_P2                         *((volatile  uint8_t *)(0x42DE8788UL))
#define bFM4_GPIO_PDORF_P2                        *((volatile  uint8_t *)(0x42DE8788UL))
#define bFM_GPIO_PDORF_P3                         *((volatile  uint8_t *)(0x42DE878CUL))
#define bFM4_GPIO_PDORF_P3                        *((volatile  uint8_t *)(0x42DE878CUL))
#define bFM_GPIO_PDORF_P4                         *((volatile  uint8_t *)(0x42DE8790UL))
#define bFM4_GPIO_PDORF_P4                        *((volatile  uint8_t *)(0x42DE8790UL))
#define bFM_GPIO_PDORF_P5                         *((volatile  uint8_t *)(0x42DE8794UL))
#define bFM4_GPIO_PDORF_P5                        *((volatile  uint8_t *)(0x42DE8794UL))
#define bFM_GPIO_PDORF_P6                         *((volatile  uint8_t *)(0x42DE8798UL))
#define bFM4_GPIO_PDORF_P6                        *((volatile  uint8_t *)(0x42DE8798UL))
#define bFM_GPIO_PDORF_P7                         *((volatile  uint8_t *)(0x42DE879CUL))
#define bFM4_GPIO_PDORF_P7                        *((volatile  uint8_t *)(0x42DE879CUL))
#define bFM_GPIO_PDORF_P8                         *((volatile  uint8_t *)(0x42DE87A0UL))
#define bFM4_GPIO_PDORF_P8                        *((volatile  uint8_t *)(0x42DE87A0UL))
#define bFM_GPIO_PDORF_P9                         *((volatile  uint8_t *)(0x42DE87A4UL))
#define bFM4_GPIO_PDORF_P9                        *((volatile  uint8_t *)(0x42DE87A4UL))
#define bFM_GPIO_PDORF_PA                         *((volatile  uint8_t *)(0x42DE87A8UL))
#define bFM4_GPIO_PDORF_PA                        *((volatile  uint8_t *)(0x42DE87A8UL))
#define bFM_GPIO_PDORF_PB                         *((volatile  uint8_t *)(0x42DE87ACUL))
#define bFM4_GPIO_PDORF_PB                        *((volatile  uint8_t *)(0x42DE87ACUL))
#define bFM_GPIO_PDORF_PC                         *((volatile  uint8_t *)(0x42DE87B0UL))
#define bFM4_GPIO_PDORF_PC                        *((volatile  uint8_t *)(0x42DE87B0UL))

#define bFM_GPIO_PDSR0_P0                         *((volatile  uint8_t *)(0x42DEE800UL))
#define bFM4_GPIO_PDSR0_P0                        *((volatile  uint8_t *)(0x42DEE800UL))
#define bFM_GPIO_PDSR0_P1                         *((volatile  uint8_t *)(0x42DEE804UL))
#define bFM4_GPIO_PDSR0_P1                        *((volatile  uint8_t *)(0x42DEE804UL))
#define bFM_GPIO_PDSR0_P2                         *((volatile  uint8_t *)(0x42DEE808UL))
#define bFM4_GPIO_PDSR0_P2                        *((volatile  uint8_t *)(0x42DEE808UL))
#define bFM_GPIO_PDSR0_P3                         *((volatile  uint8_t *)(0x42DEE80CUL))
#define bFM4_GPIO_PDSR0_P3                        *((volatile  uint8_t *)(0x42DEE80CUL))
#define bFM_GPIO_PDSR0_P4                         *((volatile  uint8_t *)(0x42DEE810UL))
#define bFM4_GPIO_PDSR0_P4                        *((volatile  uint8_t *)(0x42DEE810UL))
#define bFM_GPIO_PDSR0_P8                         *((volatile  uint8_t *)(0x42DEE820UL))
#define bFM4_GPIO_PDSR0_P8                        *((volatile  uint8_t *)(0x42DEE820UL))
#define bFM_GPIO_PDSR0_P9                         *((volatile  uint8_t *)(0x42DEE824UL))
#define bFM4_GPIO_PDSR0_P9                        *((volatile  uint8_t *)(0x42DEE824UL))
#define bFM_GPIO_PDSR0_PA                         *((volatile  uint8_t *)(0x42DEE828UL))
#define bFM4_GPIO_PDSR0_PA                        *((volatile  uint8_t *)(0x42DEE828UL))

