rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xl.h
#define bFM_GPIO_PDSR1_P0                         *((volatile  uint8_t *)(0x42DEE880UL))
#define bFM4_GPIO_PDSR1_P0                        *((volatile  uint8_t *)(0x42DEE880UL))
#define bFM_GPIO_PDSR1_P1                         *((volatile  uint8_t *)(0x42DEE884UL))
#define bFM4_GPIO_PDSR1_P1                        *((volatile  uint8_t *)(0x42DEE884UL))
#define bFM_GPIO_PDSR1_P2                         *((volatile  uint8_t *)(0x42DEE888UL))
#define bFM4_GPIO_PDSR1_P2                        *((volatile  uint8_t *)(0x42DEE888UL))
#define bFM_GPIO_PDSR1_P3                         *((volatile  uint8_t *)(0x42DEE88CUL))
#define bFM4_GPIO_PDSR1_P3                        *((volatile  uint8_t *)(0x42DEE88CUL))
#define bFM_GPIO_PDSR1_P4                         *((volatile  uint8_t *)(0x42DEE890UL))
#define bFM4_GPIO_PDSR1_P4                        *((volatile  uint8_t *)(0x42DEE890UL))
#define bFM_GPIO_PDSR1_P5                         *((volatile  uint8_t *)(0x42DEE894UL))
#define bFM4_GPIO_PDSR1_P5                        *((volatile  uint8_t *)(0x42DEE894UL))
#define bFM_GPIO_PDSR1_P6                         *((volatile  uint8_t *)(0x42DEE898UL))
#define bFM4_GPIO_PDSR1_P6                        *((volatile  uint8_t *)(0x42DEE898UL))
#define bFM_GPIO_PDSR1_P7                         *((volatile  uint8_t *)(0x42DEE89CUL))
#define bFM4_GPIO_PDSR1_P7                        *((volatile  uint8_t *)(0x42DEE89CUL))
#define bFM_GPIO_PDSR1_P8                         *((volatile  uint8_t *)(0x42DEE8A0UL))
#define bFM4_GPIO_PDSR1_P8                        *((volatile  uint8_t *)(0x42DEE8A0UL))
#define bFM_GPIO_PDSR1_P9                         *((volatile  uint8_t *)(0x42DEE8A4UL))
#define bFM4_GPIO_PDSR1_P9                        *((volatile  uint8_t *)(0x42DEE8A4UL))
#define bFM_GPIO_PDSR1_PA                         *((volatile  uint8_t *)(0x42DEE8A8UL))
#define bFM4_GPIO_PDSR1_PA                        *((volatile  uint8_t *)(0x42DEE8A8UL))
#define bFM_GPIO_PDSR1_PB                         *((volatile  uint8_t *)(0x42DEE8ACUL))
#define bFM4_GPIO_PDSR1_PB                        *((volatile  uint8_t *)(0x42DEE8ACUL))
#define bFM_GPIO_PDSR1_PC                         *((volatile  uint8_t *)(0x42DEE8B0UL))
#define bFM4_GPIO_PDSR1_PC                        *((volatile  uint8_t *)(0x42DEE8B0UL))
#define bFM_GPIO_PDSR1_PD                         *((volatile  uint8_t *)(0x42DEE8B4UL))
#define bFM4_GPIO_PDSR1_PD                        *((volatile  uint8_t *)(0x42DEE8B4UL))
#define bFM_GPIO_PDSR1_PE                         *((volatile  uint8_t *)(0x42DEE8B8UL))
#define bFM4_GPIO_PDSR1_PE                        *((volatile  uint8_t *)(0x42DEE8B8UL))
#define bFM_GPIO_PDSR1_PF                         *((volatile  uint8_t *)(0x42DEE8BCUL))
#define bFM4_GPIO_PDSR1_PF                        *((volatile  uint8_t *)(0x42DEE8BCUL))

#define bFM_GPIO_PDSR2_P0                         *((volatile  uint8_t *)(0x42DEE900UL))
#define bFM4_GPIO_PDSR2_P0                        *((volatile  uint8_t *)(0x42DEE900UL))
#define bFM_GPIO_PDSR2_P1                         *((volatile  uint8_t *)(0x42DEE904UL))
#define bFM4_GPIO_PDSR2_P1                        *((volatile  uint8_t *)(0x42DEE904UL))
#define bFM_GPIO_PDSR2_P2                         *((volatile  uint8_t *)(0x42DEE908UL))
#define bFM4_GPIO_PDSR2_P2                        *((volatile  uint8_t *)(0x42DEE908UL))
#define bFM_GPIO_PDSR2_P3                         *((volatile  uint8_t *)(0x42DEE90CUL))
#define bFM4_GPIO_PDSR2_P3                        *((volatile  uint8_t *)(0x42DEE90CUL))
#define bFM_GPIO_PDSR2_P4                         *((volatile  uint8_t *)(0x42DEE910UL))
#define bFM4_GPIO_PDSR2_P4                        *((volatile  uint8_t *)(0x42DEE910UL))
#define bFM_GPIO_PDSR2_P5                         *((volatile  uint8_t *)(0x42DEE914UL))
#define bFM4_GPIO_PDSR2_P5                        *((volatile  uint8_t *)(0x42DEE914UL))
#define bFM_GPIO_PDSR2_P6                         *((volatile  uint8_t *)(0x42DEE918UL))
#define bFM4_GPIO_PDSR2_P6                        *((volatile  uint8_t *)(0x42DEE918UL))
#define bFM_GPIO_PDSR2_P7                         *((volatile  uint8_t *)(0x42DEE91CUL))
#define bFM4_GPIO_PDSR2_P7                        *((volatile  uint8_t *)(0x42DEE91CUL))
#define bFM_GPIO_PDSR2_P8                         *((volatile  uint8_t *)(0x42DEE920UL))
#define bFM4_GPIO_PDSR2_P8                        *((volatile  uint8_t *)(0x42DEE920UL))
#define bFM_GPIO_PDSR2_P9                         *((volatile  uint8_t *)(0x42DEE924UL))
#define bFM4_GPIO_PDSR2_P9                        *((volatile  uint8_t *)(0x42DEE924UL))
#define bFM_GPIO_PDSR2_PA                         *((volatile  uint8_t *)(0x42DEE928UL))
#define bFM4_GPIO_PDSR2_PA                        *((volatile  uint8_t *)(0x42DEE928UL))

#define bFM_GPIO_PDSR3_P0                         *((volatile  uint8_t *)(0x42DEE980UL))
#define bFM4_GPIO_PDSR3_P0                        *((volatile  uint8_t *)(0x42DEE980UL))
#define bFM_GPIO_PDSR3_P1                         *((volatile  uint8_t *)(0x42DEE984UL))
#define bFM4_GPIO_PDSR3_P1                        *((volatile  uint8_t *)(0x42DEE984UL))
#define bFM_GPIO_PDSR3_P2                         *((volatile  uint8_t *)(0x42DEE988UL))
#define bFM4_GPIO_PDSR3_P2                        *((volatile  uint8_t *)(0x42DEE988UL))
#define bFM_GPIO_PDSR3_P3                         *((volatile  uint8_t *)(0x42DEE98CUL))
#define bFM4_GPIO_PDSR3_P3                        *((volatile  uint8_t *)(0x42DEE98CUL))
#define bFM_GPIO_PDSR3_P4                         *((volatile  uint8_t *)(0x42DEE990UL))
#define bFM4_GPIO_PDSR3_P4                        *((volatile  uint8_t *)(0x42DEE990UL))
#define bFM_GPIO_PDSR3_P5                         *((volatile  uint8_t *)(0x42DEE994UL))
#define bFM4_GPIO_PDSR3_P5                        *((volatile  uint8_t *)(0x42DEE994UL))
#define bFM_GPIO_PDSR3_P6                         *((volatile  uint8_t *)(0x42DEE998UL))
#define bFM4_GPIO_PDSR3_P6                        *((volatile  uint8_t *)(0x42DEE998UL))
#define bFM_GPIO_PDSR3_P7                         *((volatile  uint8_t *)(0x42DEE99CUL))
#define bFM4_GPIO_PDSR3_P7                        *((volatile  uint8_t *)(0x42DEE99CUL))
#define bFM_GPIO_PDSR3_P8                         *((volatile  uint8_t *)(0x42DEE9A0UL))
#define bFM4_GPIO_PDSR3_P8                        *((volatile  uint8_t *)(0x42DEE9A0UL))
#define bFM_GPIO_PDSR3_P9                         *((volatile  uint8_t *)(0x42DEE9A4UL))
#define bFM4_GPIO_PDSR3_P9                        *((volatile  uint8_t *)(0x42DEE9A4UL))
#define bFM_GPIO_PDSR3_PA                         *((volatile  uint8_t *)(0x42DEE9A8UL))
#define bFM4_GPIO_PDSR3_PA                        *((volatile  uint8_t *)(0x42DEE9A8UL))
#define bFM_GPIO_PDSR3_PB                         *((volatile  uint8_t *)(0x42DEE9ACUL))
#define bFM4_GPIO_PDSR3_PB                        *((volatile  uint8_t *)(0x42DEE9ACUL))
#define bFM_GPIO_PDSR3_PC                         *((volatile  uint8_t *)(0x42DEE9B0UL))
#define bFM4_GPIO_PDSR3_PC                        *((volatile  uint8_t *)(0x42DEE9B0UL))
#define bFM_GPIO_PDSR3_PD                         *((volatile  uint8_t *)(0x42DEE9B4UL))
#define bFM4_GPIO_PDSR3_PD                        *((volatile  uint8_t *)(0x42DEE9B4UL))
#define bFM_GPIO_PDSR3_PE                         *((volatile  uint8_t *)(0x42DEE9B8UL))
#define bFM4_GPIO_PDSR3_PE                        *((volatile  uint8_t *)(0x42DEE9B8UL))

#define bFM_GPIO_PDSR4_P0                         *((volatile  uint8_t *)(0x42DEEA00UL))
#define bFM4_GPIO_PDSR4_P0                        *((volatile  uint8_t *)(0x42DEEA00UL))
#define bFM_GPIO_PDSR4_P1                         *((volatile  uint8_t *)(0x42DEEA04UL))
#define bFM4_GPIO_PDSR4_P1                        *((volatile  uint8_t *)(0x42DEEA04UL))
#define bFM_GPIO_PDSR4_P2                         *((volatile  uint8_t *)(0x42DEEA08UL))
#define bFM4_GPIO_PDSR4_P2                        *((volatile  uint8_t *)(0x42DEEA08UL))
#define bFM_GPIO_PDSR4_P3                         *((volatile  uint8_t *)(0x42DEEA0CUL))
#define bFM4_GPIO_PDSR4_P3                        *((volatile  uint8_t *)(0x42DEEA0CUL))
#define bFM_GPIO_PDSR4_P4                         *((volatile  uint8_t *)(0x42DEEA10UL))
#define bFM4_GPIO_PDSR4_P4                        *((volatile  uint8_t *)(0x42DEEA10UL))
#define bFM_GPIO_PDSR4_P5                         *((volatile  uint8_t *)(0x42DEEA14UL))
#define bFM4_GPIO_PDSR4_P5                        *((volatile  uint8_t *)(0x42DEEA14UL))
#define bFM_GPIO_PDSR4_P6                         *((volatile  uint8_t *)(0x42DEEA18UL))
#define bFM4_GPIO_PDSR4_P6                        *((volatile  uint8_t *)(0x42DEEA18UL))
#define bFM_GPIO_PDSR4_P7                         *((volatile  uint8_t *)(0x42DEEA1CUL))
#define bFM4_GPIO_PDSR4_P7                        *((volatile  uint8_t *)(0x42DEEA1CUL))
#define bFM_GPIO_PDSR4_P8                         *((volatile  uint8_t *)(0x42DEEA20UL))
#define bFM4_GPIO_PDSR4_P8                        *((volatile  uint8_t *)(0x42DEEA20UL))
#define bFM_GPIO_PDSR4_P9                         *((volatile  uint8_t *)(0x42DEEA24UL))
#define bFM4_GPIO_PDSR4_P9                        *((volatile  uint8_t *)(0x42DEEA24UL))
#define bFM_GPIO_PDSR4_PA                         *((volatile  uint8_t *)(0x42DEEA28UL))
#define bFM4_GPIO_PDSR4_PA                        *((volatile  uint8_t *)(0x42DEEA28UL))
#define bFM_GPIO_PDSR4_PB                         *((volatile  uint8_t *)(0x42DEEA2CUL))
#define bFM4_GPIO_PDSR4_PB                        *((volatile  uint8_t *)(0x42DEEA2CUL))
#define bFM_GPIO_PDSR4_PC                         *((volatile  uint8_t *)(0x42DEEA30UL))
#define bFM4_GPIO_PDSR4_PC                        *((volatile  uint8_t *)(0x42DEEA30UL))
#define bFM_GPIO_PDSR4_PD                         *((volatile  uint8_t *)(0x42DEEA34UL))
#define bFM4_GPIO_PDSR4_PD                        *((volatile  uint8_t *)(0x42DEEA34UL))
#define bFM_GPIO_PDSR4_PE                         *((volatile  uint8_t *)(0x42DEEA38UL))
#define bFM4_GPIO_PDSR4_PE                        *((volatile  uint8_t *)(0x42DEEA38UL))

#define bFM_GPIO_PDSR5_P0                         *((volatile  uint8_t *)(0x42DEEA80UL))
#define bFM4_GPIO_PDSR5_P0                        *((volatile  uint8_t *)(0x42DEEA80UL))
#define bFM_GPIO_PDSR5_P1                         *((volatile  uint8_t *)(0x42DEEA84UL))
#define bFM4_GPIO_PDSR5_P1                        *((volatile  uint8_t *)(0x42DEEA84UL))
#define bFM_GPIO_PDSR5_P2                         *((volatile  uint8_t *)(0x42DEEA88UL))
#define bFM4_GPIO_PDSR5_P2                        *((volatile  uint8_t *)(0x42DEEA88UL))
#define bFM_GPIO_PDSR5_P3                         *((volatile  uint8_t *)(0x42DEEA8CUL))
#define bFM4_GPIO_PDSR5_P3                        *((volatile  uint8_t *)(0x42DEEA8CUL))
#define bFM_GPIO_PDSR5_P4                         *((volatile  uint8_t *)(0x42DEEA90UL))
#define bFM4_GPIO_PDSR5_P4                        *((volatile  uint8_t *)(0x42DEEA90UL))
#define bFM_GPIO_PDSR5_P5                         *((volatile  uint8_t *)(0x42DEEA94UL))
#define bFM4_GPIO_PDSR5_P5                        *((volatile  uint8_t *)(0x42DEEA94UL))
#define bFM_GPIO_PDSR5_P6                         *((volatile  uint8_t *)(0x42DEEA98UL))
#define bFM4_GPIO_PDSR5_P6                        *((volatile  uint8_t *)(0x42DEEA98UL))
#define bFM_GPIO_PDSR5_P7                         *((volatile  uint8_t *)(0x42DEEA9CUL))
#define bFM4_GPIO_PDSR5_P7                        *((volatile  uint8_t *)(0x42DEEA9CUL))
#define bFM_GPIO_PDSR5_P8                         *((volatile  uint8_t *)(0x42DEEAA0UL))
#define bFM4_GPIO_PDSR5_P8                        *((volatile  uint8_t *)(0x42DEEAA0UL))
#define bFM_GPIO_PDSR5_P9                         *((volatile  uint8_t *)(0x42DEEAA4UL))
#define bFM4_GPIO_PDSR5_P9                        *((volatile  uint8_t *)(0x42DEEAA4UL))
#define bFM_GPIO_PDSR5_PA                         *((volatile  uint8_t *)(0x42DEEAA8UL))
#define bFM4_GPIO_PDSR5_PA                        *((volatile  uint8_t *)(0x42DEEAA8UL))
#define bFM_GPIO_PDSR5_PB                         *((volatile  uint8_t *)(0x42DEEAACUL))
#define bFM4_GPIO_PDSR5_PB                        *((volatile  uint8_t *)(0x42DEEAACUL))
#define bFM_GPIO_PDSR5_PC                         *((volatile  uint8_t *)(0x42DEEAB0UL))
#define bFM4_GPIO_PDSR5_PC                        *((volatile  uint8_t *)(0x42DEEAB0UL))
#define bFM_GPIO_PDSR5_PD                         *((volatile  uint8_t *)(0x42DEEAB4UL))
#define bFM4_GPIO_PDSR5_PD                        *((volatile  uint8_t *)(0x42DEEAB4UL))
#define bFM_GPIO_PDSR5_PE                         *((volatile  uint8_t *)(0x42DEEAB8UL))
#define bFM4_GPIO_PDSR5_PE                        *((volatile  uint8_t *)(0x42DEEAB8UL))
#define bFM_GPIO_PDSR5_PF                         *((volatile  uint8_t *)(0x42DEEABCUL))
#define bFM4_GPIO_PDSR5_PF                        *((volatile  uint8_t *)(0x42DEEABCUL))

#define bFM_GPIO_PDSR6_P0                         *((volatile  uint8_t *)(0x42DEEB00UL))
#define bFM4_GPIO_PDSR6_P0                        *((volatile  uint8_t *)(0x42DEEB00UL))
#define bFM_GPIO_PDSR6_P1                         *((volatile  uint8_t *)(0x42DEEB04UL))
#define bFM4_GPIO_PDSR6_P1                        *((volatile  uint8_t *)(0x42DEEB04UL))
#define bFM_GPIO_PDSR6_P2                         *((volatile  uint8_t *)(0x42DEEB08UL))
#define bFM4_GPIO_PDSR6_P2                        *((volatile  uint8_t *)(0x42DEEB08UL))
#define bFM_GPIO_PDSR6_P3                         *((volatile  uint8_t *)(0x42DEEB0CUL))
#define bFM4_GPIO_PDSR6_P3                        *((volatile  uint8_t *)(0x42DEEB0CUL))
#define bFM_GPIO_PDSR6_P4                         *((volatile  uint8_t *)(0x42DEEB10UL))
#define bFM4_GPIO_PDSR6_P4                        *((volatile  uint8_t *)(0x42DEEB10UL))
#define bFM_GPIO_PDSR6_P5                         *((volatile  uint8_t *)(0x42DEEB14UL))
#define bFM4_GPIO_PDSR6_P5                        *((volatile  uint8_t *)(0x42DEEB14UL))
#define bFM_GPIO_PDSR6_P6                         *((volatile  uint8_t *)(0x42DEEB18UL))
#define bFM4_GPIO_PDSR6_P6                        *((volatile  uint8_t *)(0x42DEEB18UL))
#define bFM_GPIO_PDSR6_P7                         *((volatile  uint8_t *)(0x42DEEB1CUL))
#define bFM4_GPIO_PDSR6_P7                        *((volatile  uint8_t *)(0x42DEEB1CUL))
#define bFM_GPIO_PDSR6_P8                         *((volatile  uint8_t *)(0x42DEEB20UL))
#define bFM4_GPIO_PDSR6_P8                        *((volatile  uint8_t *)(0x42DEEB20UL))
#define bFM_GPIO_PDSR6_P9                         *((volatile  uint8_t *)(0x42DEEB24UL))
#define bFM4_GPIO_PDSR6_P9                        *((volatile  uint8_t *)(0x42DEEB24UL))
#define bFM_GPIO_PDSR6_PA                         *((volatile  uint8_t *)(0x42DEEB28UL))
#define bFM4_GPIO_PDSR6_PA                        *((volatile  uint8_t *)(0x42DEEB28UL))
#define bFM_GPIO_PDSR6_PB                         *((volatile  uint8_t *)(0x42DEEB2CUL))
#define bFM4_GPIO_PDSR6_PB                        *((volatile  uint8_t *)(0x42DEEB2CUL))
#define bFM_GPIO_PDSR6_PC                         *((volatile  uint8_t *)(0x42DEEB30UL))
#define bFM4_GPIO_PDSR6_PC                        *((volatile  uint8_t *)(0x42DEEB30UL))
#define bFM_GPIO_PDSR6_PD                         *((volatile  uint8_t *)(0x42DEEB34UL))
#define bFM4_GPIO_PDSR6_PD                        *((volatile  uint8_t *)(0x42DEEB34UL))
#define bFM_GPIO_PDSR6_PE                         *((volatile  uint8_t *)(0x42DEEB38UL))
#define bFM4_GPIO_PDSR6_PE                        *((volatile  uint8_t *)(0x42DEEB38UL))

#define bFM_GPIO_PDSR7_P0                         *((volatile  uint8_t *)(0x42DEEB80UL))
#define bFM4_GPIO_PDSR7_P0                        *((volatile  uint8_t *)(0x42DEEB80UL))
#define bFM_GPIO_PDSR7_P1                         *((volatile  uint8_t *)(0x42DEEB84UL))
#define bFM4_GPIO_PDSR7_P1                        *((volatile  uint8_t *)(0x42DEEB84UL))
#define bFM_GPIO_PDSR7_P2                         *((volatile  uint8_t *)(0x42DEEB88UL))
#define bFM4_GPIO_PDSR7_P2                        *((volatile  uint8_t *)(0x42DEEB88UL))
#define bFM_GPIO_PDSR7_P3                         *((volatile  uint8_t *)(0x42DEEB8CUL))
#define bFM4_GPIO_PDSR7_P3                        *((volatile  uint8_t *)(0x42DEEB8CUL))
#define bFM_GPIO_PDSR7_P4                         *((volatile  uint8_t *)(0x42DEEB90UL))
#define bFM4_GPIO_PDSR7_P4                        *((volatile  uint8_t *)(0x42DEEB90UL))
#define bFM_GPIO_PDSR7_P5                         *((volatile  uint8_t *)(0x42DEEB94UL))
#define bFM4_GPIO_PDSR7_P5                        *((volatile  uint8_t *)(0x42DEEB94UL))
#define bFM_GPIO_PDSR7_P6                         *((volatile  uint8_t *)(0x42DEEB98UL))
#define bFM4_GPIO_PDSR7_P6                        *((volatile  uint8_t *)(0x42DEEB98UL))
#define bFM_GPIO_PDSR7_P7                         *((volatile  uint8_t *)(0x42DEEB9CUL))
#define bFM4_GPIO_PDSR7_P7                        *((volatile  uint8_t *)(0x42DEEB9CUL))
#define bFM_GPIO_PDSR7_P8                         *((volatile  uint8_t *)(0x42DEEBA0UL))
#define bFM4_GPIO_PDSR7_P8                        *((volatile  uint8_t *)(0x42DEEBA0UL))
#define bFM_GPIO_PDSR7_P9                         *((volatile  uint8_t *)(0x42DEEBA4UL))
#define bFM4_GPIO_PDSR7_P9                        *((volatile  uint8_t *)(0x42DEEBA4UL))
#define bFM_GPIO_PDSR7_PA                         *((volatile  uint8_t *)(0x42DEEBA8UL))
#define bFM4_GPIO_PDSR7_PA                        *((volatile  uint8_t *)(0x42DEEBA8UL))
#define bFM_GPIO_PDSR7_PB                         *((volatile  uint8_t *)(0x42DEEBACUL))
#define bFM4_GPIO_PDSR7_PB                        *((volatile  uint8_t *)(0x42DEEBACUL))
#define bFM_GPIO_PDSR7_PC                         *((volatile  uint8_t *)(0x42DEEBB0UL))
#define bFM4_GPIO_PDSR7_PC                        *((volatile  uint8_t *)(0x42DEEBB0UL))
#define bFM_GPIO_PDSR7_PD                         *((volatile  uint8_t *)(0x42DEEBB4UL))
#define bFM4_GPIO_PDSR7_PD                        *((volatile  uint8_t *)(0x42DEEBB4UL))
#define bFM_GPIO_PDSR7_PE                         *((volatile  uint8_t *)(0x42DEEBB8UL))
#define bFM4_GPIO_PDSR7_PE                        *((volatile  uint8_t *)(0x42DEEBB8UL))

#define bFM_GPIO_PDSR8_P0                         *((volatile  uint8_t *)(0x42DEEC00UL))
#define bFM4_GPIO_PDSR8_P0                        *((volatile  uint8_t *)(0x42DEEC00UL))
#define bFM_GPIO_PDSR8_P1                         *((volatile  uint8_t *)(0x42DEEC04UL))
#define bFM4_GPIO_PDSR8_P1                        *((volatile  uint8_t *)(0x42DEEC04UL))
#define bFM_GPIO_PDSR8_P2                         *((volatile  uint8_t *)(0x42DEEC08UL))
#define bFM4_GPIO_PDSR8_P2                        *((volatile  uint8_t *)(0x42DEEC08UL))
#define bFM_GPIO_PDSR8_P3                         *((volatile  uint8_t *)(0x42DEEC0CUL))
#define bFM4_GPIO_PDSR8_P3                        *((volatile  uint8_t *)(0x42DEEC0CUL))

#define bFM_GPIO_PDSR9_P0                         *((volatile  uint8_t *)(0x42DEEC80UL))
#define bFM4_GPIO_PDSR9_P0                        *((volatile  uint8_t *)(0x42DEEC80UL))
#define bFM_GPIO_PDSR9_P1                         *((volatile  uint8_t *)(0x42DEEC84UL))
#define bFM4_GPIO_PDSR9_P1                        *((volatile  uint8_t *)(0x42DEEC84UL))
#define bFM_GPIO_PDSR9_P2                         *((volatile  uint8_t *)(0x42DEEC88UL))
#define bFM4_GPIO_PDSR9_P2                        *((volatile  uint8_t *)(0x42DEEC88UL))
#define bFM_GPIO_PDSR9_P3                         *((volatile  uint8_t *)(0x42DEEC8CUL))
#define bFM4_GPIO_PDSR9_P3                        *((volatile  uint8_t *)(0x42DEEC8CUL))
#define bFM_GPIO_PDSR9_P4                         *((volatile  uint8_t *)(0x42DEEC90UL))
#define bFM4_GPIO_PDSR9_P4                        *((volatile  uint8_t *)(0x42DEEC90UL))
#define bFM_GPIO_PDSR9_P5                         *((volatile  uint8_t *)(0x42DEEC94UL))
#define bFM4_GPIO_PDSR9_P5                        *((volatile  uint8_t *)(0x42DEEC94UL))
#define bFM_GPIO_PDSR9_P6                         *((volatile  uint8_t *)(0x42DEEC98UL))
#define bFM4_GPIO_PDSR9_P6                        *((volatile  uint8_t *)(0x42DEEC98UL))
#define bFM_GPIO_PDSR9_P7                         *((volatile  uint8_t *)(0x42DEEC9CUL))
#define bFM4_GPIO_PDSR9_P7                        *((volatile  uint8_t *)(0x42DEEC9CUL))

#define bFM_GPIO_PDSRA_P0                         *((volatile  uint8_t *)(0x42DEED00UL))
#define bFM4_GPIO_PDSRA_P0                        *((volatile  uint8_t *)(0x42DEED00UL))
#define bFM_GPIO_PDSRA_P1                         *((volatile  uint8_t *)(0x42DEED04UL))
#define bFM4_GPIO_PDSRA_P1                        *((volatile  uint8_t *)(0x42DEED04UL))
#define bFM_GPIO_PDSRA_P2                         *((volatile  uint8_t *)(0x42DEED08UL))
#define bFM4_GPIO_PDSRA_P2                        *((volatile  uint8_t *)(0x42DEED08UL))
#define bFM_GPIO_PDSRA_P3                         *((volatile  uint8_t *)(0x42DEED0CUL))
#define bFM4_GPIO_PDSRA_P3                        *((volatile  uint8_t *)(0x42DEED0CUL))
#define bFM_GPIO_PDSRA_P4                         *((volatile  uint8_t *)(0x42DEED10UL))
#define bFM4_GPIO_PDSRA_P4                        *((volatile  uint8_t *)(0x42DEED10UL))
#define bFM_GPIO_PDSRA_P5                         *((volatile  uint8_t *)(0x42DEED14UL))
#define bFM4_GPIO_PDSRA_P5                        *((volatile  uint8_t *)(0x42DEED14UL))
#define bFM_GPIO_PDSRA_P6                         *((volatile  uint8_t *)(0x42DEED18UL))
#define bFM4_GPIO_PDSRA_P6                        *((volatile  uint8_t *)(0x42DEED18UL))
#define bFM_GPIO_PDSRA_P7                         *((volatile  uint8_t *)(0x42DEED1CUL))
#define bFM4_GPIO_PDSRA_P7                        *((volatile  uint8_t *)(0x42DEED1CUL))
#define bFM_GPIO_PDSRA_P8                         *((volatile  uint8_t *)(0x42DEED20UL))
#define bFM4_GPIO_PDSRA_P8                        *((volatile  uint8_t *)(0x42DEED20UL))
#define bFM_GPIO_PDSRA_P9                         *((volatile  uint8_t *)(0x42DEED24UL))
#define bFM4_GPIO_PDSRA_P9                        *((volatile  uint8_t *)(0x42DEED24UL))
#define bFM_GPIO_PDSRA_PA                         *((volatile  uint8_t *)(0x42DEED28UL))
#define bFM4_GPIO_PDSRA_PA                        *((volatile  uint8_t *)(0x42DEED28UL))
#define bFM_GPIO_PDSRA_PB                         *((volatile  uint8_t *)(0x42DEED2CUL))
#define bFM4_GPIO_PDSRA_PB                        *((volatile  uint8_t *)(0x42DEED2CUL))
#define bFM_GPIO_PDSRA_PC                         *((volatile  uint8_t *)(0x42DEED30UL))
#define bFM4_GPIO_PDSRA_PC                        *((volatile  uint8_t *)(0x42DEED30UL))
#define bFM_GPIO_PDSRA_PD                         *((volatile  uint8_t *)(0x42DEED34UL))
#define bFM4_GPIO_PDSRA_PD                        *((volatile  uint8_t *)(0x42DEED34UL))
#define bFM_GPIO_PDSRA_PE                         *((volatile  uint8_t *)(0x42DEED38UL))
#define bFM4_GPIO_PDSRA_PE                        *((volatile  uint8_t *)(0x42DEED38UL))
#define bFM_GPIO_PDSRA_PF                         *((volatile  uint8_t *)(0x42DEED3CUL))
#define bFM4_GPIO_PDSRA_PF                        *((volatile  uint8_t *)(0x42DEED3CUL))

