rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xl.h
#define bFM_MFS12_LIN_ESCR_LBIE                   *((volatile  uint8_t *)(0x42718090UL))
#define bFM4_MFS12_LIN_ESCR_LBIE                  *((volatile  uint8_t *)(0x42718090UL))
#define bFM_MFS12_LIN_ESCR_ESBL                   *((volatile  uint8_t *)(0x42718098UL))
#define bFM4_MFS12_LIN_ESCR_ESBL                  *((volatile  uint8_t *)(0x42718098UL))

#define bFM_MFS12_LIN_FCR_FE1                     *((volatile  uint8_t *)(0x42718280UL))
#define bFM4_MFS12_LIN_FCR_FE1                    *((volatile  uint8_t *)(0x42718280UL))
#define bFM_MFS12_LIN_FCR_FE2                     *((volatile  uint8_t *)(0x42718284UL))
#define bFM4_MFS12_LIN_FCR_FE2                    *((volatile  uint8_t *)(0x42718284UL))
#define bFM_MFS12_LIN_FCR_FCL1                    *((volatile  uint8_t *)(0x42718288UL))
#define bFM4_MFS12_LIN_FCR_FCL1                   *((volatile  uint8_t *)(0x42718288UL))
#define bFM_MFS12_LIN_FCR_FCL2                    *((volatile  uint8_t *)(0x4271828CUL))
#define bFM4_MFS12_LIN_FCR_FCL2                   *((volatile  uint8_t *)(0x4271828CUL))
#define bFM_MFS12_LIN_FCR_FSET                    *((volatile  uint8_t *)(0x42718290UL))
#define bFM4_MFS12_LIN_FCR_FSET                   *((volatile  uint8_t *)(0x42718290UL))
#define bFM_MFS12_LIN_FCR_FLD                     *((volatile  uint8_t *)(0x42718294UL))
#define bFM4_MFS12_LIN_FCR_FLD                    *((volatile  uint8_t *)(0x42718294UL))
#define bFM_MFS12_LIN_FCR_FLST                    *((volatile  uint8_t *)(0x42718298UL))
#define bFM4_MFS12_LIN_FCR_FLST                   *((volatile  uint8_t *)(0x42718298UL))
#define bFM_MFS12_LIN_FCR_FSEL                    *((volatile  uint8_t *)(0x427182A0UL))
#define bFM4_MFS12_LIN_FCR_FSEL                   *((volatile  uint8_t *)(0x427182A0UL))
#define bFM_MFS12_LIN_FCR_FTIE                    *((volatile  uint8_t *)(0x427182A4UL))
#define bFM4_MFS12_LIN_FCR_FTIE                   *((volatile  uint8_t *)(0x427182A4UL))
#define bFM_MFS12_LIN_FCR_FDRQ                    *((volatile  uint8_t *)(0x427182A8UL))
#define bFM4_MFS12_LIN_FCR_FDRQ                   *((volatile  uint8_t *)(0x427182A8UL))
#define bFM_MFS12_LIN_FCR_FRIIE                   *((volatile  uint8_t *)(0x427182ACUL))
#define bFM4_MFS12_LIN_FCR_FRIIE                  *((volatile  uint8_t *)(0x427182ACUL))
#define bFM_MFS12_LIN_FCR_FLSTE                   *((volatile  uint8_t *)(0x427182B0UL))
#define bFM4_MFS12_LIN_FCR_FLSTE                  *((volatile  uint8_t *)(0x427182B0UL))

#define bFM_MFS12_LIN_SCR_TXE                     *((volatile  uint8_t *)(0x42718020UL))
#define bFM4_MFS12_LIN_SCR_TXE                    *((volatile  uint8_t *)(0x42718020UL))
#define bFM_MFS12_LIN_SCR_RXE                     *((volatile  uint8_t *)(0x42718024UL))
#define bFM4_MFS12_LIN_SCR_RXE                    *((volatile  uint8_t *)(0x42718024UL))
#define bFM_MFS12_LIN_SCR_TBIE                    *((volatile  uint8_t *)(0x42718028UL))
#define bFM4_MFS12_LIN_SCR_TBIE                   *((volatile  uint8_t *)(0x42718028UL))
#define bFM_MFS12_LIN_SCR_TIE                     *((volatile  uint8_t *)(0x4271802CUL))
#define bFM4_MFS12_LIN_SCR_TIE                    *((volatile  uint8_t *)(0x4271802CUL))
#define bFM_MFS12_LIN_SCR_RIE                     *((volatile  uint8_t *)(0x42718030UL))
#define bFM4_MFS12_LIN_SCR_RIE                    *((volatile  uint8_t *)(0x42718030UL))
#define bFM_MFS12_LIN_SCR_LBR                     *((volatile  uint8_t *)(0x42718034UL))
#define bFM4_MFS12_LIN_SCR_LBR                    *((volatile  uint8_t *)(0x42718034UL))
#define bFM_MFS12_LIN_SCR_MS                      *((volatile  uint8_t *)(0x42718038UL))
#define bFM4_MFS12_LIN_SCR_MS                     *((volatile  uint8_t *)(0x42718038UL))
#define bFM_MFS12_LIN_SCR_UPCL                    *((volatile  uint8_t *)(0x4271803CUL))
#define bFM4_MFS12_LIN_SCR_UPCL                   *((volatile  uint8_t *)(0x4271803CUL))

#define bFM_MFS12_LIN_SMR_SOE                     *((volatile  uint8_t *)(0x42718000UL))
#define bFM4_MFS12_LIN_SMR_SOE                    *((volatile  uint8_t *)(0x42718000UL))
#define bFM_MFS12_LIN_SMR_SBL                     *((volatile  uint8_t *)(0x4271800CUL))
#define bFM4_MFS12_LIN_SMR_SBL                    *((volatile  uint8_t *)(0x4271800CUL))
#define bFM_MFS12_LIN_SMR_WUCR                    *((volatile  uint8_t *)(0x42718010UL))
#define bFM4_MFS12_LIN_SMR_WUCR                   *((volatile  uint8_t *)(0x42718010UL))

#define bFM_MFS12_LIN_SSR_TBI                     *((volatile  uint8_t *)(0x427180A0UL))
#define bFM4_MFS12_LIN_SSR_TBI                    *((volatile  uint8_t *)(0x427180A0UL))
#define bFM_MFS12_LIN_SSR_TDRE                    *((volatile  uint8_t *)(0x427180A4UL))
#define bFM4_MFS12_LIN_SSR_TDRE                   *((volatile  uint8_t *)(0x427180A4UL))
#define bFM_MFS12_LIN_SSR_RDRF                    *((volatile  uint8_t *)(0x427180A8UL))
#define bFM4_MFS12_LIN_SSR_RDRF                   *((volatile  uint8_t *)(0x427180A8UL))
#define bFM_MFS12_LIN_SSR_ORE                     *((volatile  uint8_t *)(0x427180ACUL))
#define bFM4_MFS12_LIN_SSR_ORE                    *((volatile  uint8_t *)(0x427180ACUL))
#define bFM_MFS12_LIN_SSR_FRE                     *((volatile  uint8_t *)(0x427180B0UL))
#define bFM4_MFS12_LIN_SSR_FRE                    *((volatile  uint8_t *)(0x427180B0UL))
#define bFM_MFS12_LIN_SSR_LBD                     *((volatile  uint8_t *)(0x427180B4UL))
#define bFM4_MFS12_LIN_SSR_LBD                    *((volatile  uint8_t *)(0x427180B4UL))
#define bFM_MFS12_LIN_SSR_REC                     *((volatile  uint8_t *)(0x427180BCUL))
#define bFM4_MFS12_LIN_SSR_REC                    *((volatile  uint8_t *)(0x427180BCUL))

#define bFM_MFS12_UART_BGR_EXT                    *((volatile  uint8_t *)(0x427181BCUL))
#define bFM4_MFS12_UART_BGR_EXT                   *((volatile  uint8_t *)(0x427181BCUL))

#define bFM_MFS12_UART_ESCR_P                     *((volatile  uint8_t *)(0x4271808CUL))
#define bFM4_MFS12_UART_ESCR_P                    *((volatile  uint8_t *)(0x4271808CUL))
#define bFM_MFS12_UART_ESCR_PEN                   *((volatile  uint8_t *)(0x42718090UL))
#define bFM4_MFS12_UART_ESCR_PEN                  *((volatile  uint8_t *)(0x42718090UL))
#define bFM_MFS12_UART_ESCR_INV                   *((volatile  uint8_t *)(0x42718094UL))
#define bFM4_MFS12_UART_ESCR_INV                  *((volatile  uint8_t *)(0x42718094UL))
#define bFM_MFS12_UART_ESCR_ESBL                  *((volatile  uint8_t *)(0x42718098UL))
#define bFM4_MFS12_UART_ESCR_ESBL                 *((volatile  uint8_t *)(0x42718098UL))
#define bFM_MFS12_UART_ESCR_FLWEN                 *((volatile  uint8_t *)(0x4271809CUL))
#define bFM4_MFS12_UART_ESCR_FLWEN                *((volatile  uint8_t *)(0x4271809CUL))

