rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xl.h
#define bFM_MFS15_CSIO_SACSR_TMRE                 *((volatile  uint8_t *)(0x4271E480UL))
#define bFM4_MFS15_CSIO_SACSR_TMRE                *((volatile  uint8_t *)(0x4271E480UL))
#define bFM_MFS15_CSIO_SACSR_TSYNE                *((volatile  uint8_t *)(0x4271E498UL))
#define bFM4_MFS15_CSIO_SACSR_TSYNE               *((volatile  uint8_t *)(0x4271E498UL))
#define bFM_MFS15_CSIO_SACSR_TINTE                *((volatile  uint8_t *)(0x4271E49CUL))
#define bFM4_MFS15_CSIO_SACSR_TINTE               *((volatile  uint8_t *)(0x4271E49CUL))
#define bFM_MFS15_CSIO_SACSR_TINT                 *((volatile  uint8_t *)(0x4271E4A0UL))
#define bFM4_MFS15_CSIO_SACSR_TINT                *((volatile  uint8_t *)(0x4271E4A0UL))
#define bFM_MFS15_CSIO_SACSR_CSE                  *((volatile  uint8_t *)(0x4271E4ACUL))
#define bFM4_MFS15_CSIO_SACSR_CSE                 *((volatile  uint8_t *)(0x4271E4ACUL))
#define bFM_MFS15_CSIO_SACSR_CSEIE                *((volatile  uint8_t *)(0x4271E4B0UL))
#define bFM4_MFS15_CSIO_SACSR_CSEIE               *((volatile  uint8_t *)(0x4271E4B0UL))
#define bFM_MFS15_CSIO_SACSR_TBEEN                *((volatile  uint8_t *)(0x4271E4B4UL))
#define bFM4_MFS15_CSIO_SACSR_TBEEN               *((volatile  uint8_t *)(0x4271E4B4UL))

#define bFM_MFS15_CSIO_SCR_TXE                    *((volatile  uint8_t *)(0x4271E020UL))
#define bFM4_MFS15_CSIO_SCR_TXE                   *((volatile  uint8_t *)(0x4271E020UL))
#define bFM_MFS15_CSIO_SCR_RXE                    *((volatile  uint8_t *)(0x4271E024UL))
#define bFM4_MFS15_CSIO_SCR_RXE                   *((volatile  uint8_t *)(0x4271E024UL))
#define bFM_MFS15_CSIO_SCR_TBIE                   *((volatile  uint8_t *)(0x4271E028UL))
#define bFM4_MFS15_CSIO_SCR_TBIE                  *((volatile  uint8_t *)(0x4271E028UL))
#define bFM_MFS15_CSIO_SCR_TIE                    *((volatile  uint8_t *)(0x4271E02CUL))
#define bFM4_MFS15_CSIO_SCR_TIE                   *((volatile  uint8_t *)(0x4271E02CUL))
#define bFM_MFS15_CSIO_SCR_RIE                    *((volatile  uint8_t *)(0x4271E030UL))
#define bFM4_MFS15_CSIO_SCR_RIE                   *((volatile  uint8_t *)(0x4271E030UL))
#define bFM_MFS15_CSIO_SCR_SPI                    *((volatile  uint8_t *)(0x4271E034UL))
#define bFM4_MFS15_CSIO_SCR_SPI                   *((volatile  uint8_t *)(0x4271E034UL))
#define bFM_MFS15_CSIO_SCR_MS                     *((volatile  uint8_t *)(0x4271E038UL))
#define bFM4_MFS15_CSIO_SCR_MS                    *((volatile  uint8_t *)(0x4271E038UL))
#define bFM_MFS15_CSIO_SCR_UPCL                   *((volatile  uint8_t *)(0x4271E03CUL))
#define bFM4_MFS15_CSIO_SCR_UPCL                  *((volatile  uint8_t *)(0x4271E03CUL))

#define bFM_MFS15_CSIO_SCSCR_CSOE                 *((volatile  uint8_t *)(0x4271E600UL))
#define bFM4_MFS15_CSIO_SCSCR_CSOE                *((volatile  uint8_t *)(0x4271E600UL))
#define bFM_MFS15_CSIO_SCSCR_CSEN0                *((volatile  uint8_t *)(0x4271E604UL))
#define bFM4_MFS15_CSIO_SCSCR_CSEN0               *((volatile  uint8_t *)(0x4271E604UL))
#define bFM_MFS15_CSIO_SCSCR_CSEN1                *((volatile  uint8_t *)(0x4271E608UL))
#define bFM4_MFS15_CSIO_SCSCR_CSEN1               *((volatile  uint8_t *)(0x4271E608UL))
#define bFM_MFS15_CSIO_SCSCR_CSEN2                *((volatile  uint8_t *)(0x4271E60CUL))
#define bFM4_MFS15_CSIO_SCSCR_CSEN2               *((volatile  uint8_t *)(0x4271E60CUL))
#define bFM_MFS15_CSIO_SCSCR_CSEN3                *((volatile  uint8_t *)(0x4271E610UL))
#define bFM4_MFS15_CSIO_SCSCR_CSEN3               *((volatile  uint8_t *)(0x4271E610UL))
#define bFM_MFS15_CSIO_SCSCR_CSLVL                *((volatile  uint8_t *)(0x4271E614UL))
#define bFM4_MFS15_CSIO_SCSCR_CSLVL               *((volatile  uint8_t *)(0x4271E614UL))
#define bFM_MFS15_CSIO_SCSCR_SCAM                 *((volatile  uint8_t *)(0x4271E624UL))
#define bFM4_MFS15_CSIO_SCSCR_SCAM                *((volatile  uint8_t *)(0x4271E624UL))

#define bFM_MFS15_CSIO_SCSFR0_CS1SPI              *((volatile  uint8_t *)(0x4271E694UL))
#define bFM4_MFS15_CSIO_SCSFR0_CS1SPI             *((volatile  uint8_t *)(0x4271E694UL))
#define bFM_MFS15_CSIO_SCSFR0_CS1SCINV            *((volatile  uint8_t *)(0x4271E698UL))
#define bFM4_MFS15_CSIO_SCSFR0_CS1SCINV           *((volatile  uint8_t *)(0x4271E698UL))
#define bFM_MFS15_CSIO_SCSFR0_CS1CSLVL            *((volatile  uint8_t *)(0x4271E69CUL))
#define bFM4_MFS15_CSIO_SCSFR0_CS1CSLVL           *((volatile  uint8_t *)(0x4271E69CUL))

#define bFM_MFS15_CSIO_SCSFR1_CS2SPI              *((volatile  uint8_t *)(0x4271E6B4UL))
#define bFM4_MFS15_CSIO_SCSFR1_CS2SPI             *((volatile  uint8_t *)(0x4271E6B4UL))
#define bFM_MFS15_CSIO_SCSFR1_CS2SCINV            *((volatile  uint8_t *)(0x4271E6B8UL))
#define bFM4_MFS15_CSIO_SCSFR1_CS2SCINV           *((volatile  uint8_t *)(0x4271E6B8UL))
#define bFM_MFS15_CSIO_SCSFR1_CS2CSLVL            *((volatile  uint8_t *)(0x4271E6BCUL))
#define bFM4_MFS15_CSIO_SCSFR1_CS2CSLVL           *((volatile  uint8_t *)(0x4271E6BCUL))

#define bFM_MFS15_CSIO_SCSFR2_CS3SPI              *((volatile  uint8_t *)(0x4271E714UL))
#define bFM4_MFS15_CSIO_SCSFR2_CS3SPI             *((volatile  uint8_t *)(0x4271E714UL))
#define bFM_MFS15_CSIO_SCSFR2_CS3SCINV            *((volatile  uint8_t *)(0x4271E718UL))
#define bFM4_MFS15_CSIO_SCSFR2_CS3SCINV           *((volatile  uint8_t *)(0x4271E718UL))
#define bFM_MFS15_CSIO_SCSFR2_CS3CSLVL            *((volatile  uint8_t *)(0x4271E71CUL))
#define bFM4_MFS15_CSIO_SCSFR2_CS3CSLVL           *((volatile  uint8_t *)(0x4271E71CUL))

#define bFM_MFS15_CSIO_SMR_SOE                    *((volatile  uint8_t *)(0x4271E000UL))
#define bFM4_MFS15_CSIO_SMR_SOE                   *((volatile  uint8_t *)(0x4271E000UL))
#define bFM_MFS15_CSIO_SMR_SCKE                   *((volatile  uint8_t *)(0x4271E004UL))
#define bFM4_MFS15_CSIO_SMR_SCKE                  *((volatile  uint8_t *)(0x4271E004UL))
#define bFM_MFS15_CSIO_SMR_BDS                    *((volatile  uint8_t *)(0x4271E008UL))
#define bFM4_MFS15_CSIO_SMR_BDS                   *((volatile  uint8_t *)(0x4271E008UL))
#define bFM_MFS15_CSIO_SMR_SCINV                  *((volatile  uint8_t *)(0x4271E00CUL))
#define bFM4_MFS15_CSIO_SMR_SCINV                 *((volatile  uint8_t *)(0x4271E00CUL))

#define bFM_MFS15_CSIO_SSR_TBI                    *((volatile  uint8_t *)(0x4271E0A0UL))
#define bFM4_MFS15_CSIO_SSR_TBI                   *((volatile  uint8_t *)(0x4271E0A0UL))
#define bFM_MFS15_CSIO_SSR_TDRE                   *((volatile  uint8_t *)(0x4271E0A4UL))
#define bFM4_MFS15_CSIO_SSR_TDRE                  *((volatile  uint8_t *)(0x4271E0A4UL))
#define bFM_MFS15_CSIO_SSR_RDRF                   *((volatile  uint8_t *)(0x4271E0A8UL))
#define bFM4_MFS15_CSIO_SSR_RDRF                  *((volatile  uint8_t *)(0x4271E0A8UL))
#define bFM_MFS15_CSIO_SSR_ORE                    *((volatile  uint8_t *)(0x4271E0ACUL))
#define bFM4_MFS15_CSIO_SSR_ORE                   *((volatile  uint8_t *)(0x4271E0ACUL))
#define bFM_MFS15_CSIO_SSR_AWC                    *((volatile  uint8_t *)(0x4271E0B0UL))
#define bFM4_MFS15_CSIO_SSR_AWC                   *((volatile  uint8_t *)(0x4271E0B0UL))
#define bFM_MFS15_CSIO_SSR_REC                    *((volatile  uint8_t *)(0x4271E0BCUL))
#define bFM4_MFS15_CSIO_SSR_REC                   *((volatile  uint8_t *)(0x4271E0BCUL))

#define bFM_MFS15_I2C_EIBCR_BEC                   *((volatile  uint8_t *)(0x4271E3A0UL))
#define bFM4_MFS15_I2C_EIBCR_BEC                  *((volatile  uint8_t *)(0x4271E3A0UL))
#define bFM_MFS15_I2C_EIBCR_SOCE                  *((volatile  uint8_t *)(0x4271E3A4UL))
#define bFM4_MFS15_I2C_EIBCR_SOCE                 *((volatile  uint8_t *)(0x4271E3A4UL))
#define bFM_MFS15_I2C_EIBCR_SCLC                  *((volatile  uint8_t *)(0x4271E3A8UL))
#define bFM4_MFS15_I2C_EIBCR_SCLC                 *((volatile  uint8_t *)(0x4271E3A8UL))
#define bFM_MFS15_I2C_EIBCR_SDAC                  *((volatile  uint8_t *)(0x4271E3ACUL))
#define bFM4_MFS15_I2C_EIBCR_SDAC                 *((volatile  uint8_t *)(0x4271E3ACUL))
#define bFM_MFS15_I2C_EIBCR_SCLS                  *((volatile  uint8_t *)(0x4271E3B0UL))
#define bFM4_MFS15_I2C_EIBCR_SCLS                 *((volatile  uint8_t *)(0x4271E3B0UL))
#define bFM_MFS15_I2C_EIBCR_SDAS                  *((volatile  uint8_t *)(0x4271E3B4UL))
#define bFM4_MFS15_I2C_EIBCR_SDAS                 *((volatile  uint8_t *)(0x4271E3B4UL))

#define bFM_MFS15_I2C_FCR_FE1                     *((volatile  uint8_t *)(0x4271E280UL))
#define bFM4_MFS15_I2C_FCR_FE1                    *((volatile  uint8_t *)(0x4271E280UL))
#define bFM_MFS15_I2C_FCR_FE2                     *((volatile  uint8_t *)(0x4271E284UL))
#define bFM4_MFS15_I2C_FCR_FE2                    *((volatile  uint8_t *)(0x4271E284UL))
#define bFM_MFS15_I2C_FCR_FCL1                    *((volatile  uint8_t *)(0x4271E288UL))
#define bFM4_MFS15_I2C_FCR_FCL1                   *((volatile  uint8_t *)(0x4271E288UL))
#define bFM_MFS15_I2C_FCR_FCL2                    *((volatile  uint8_t *)(0x4271E28CUL))
#define bFM4_MFS15_I2C_FCR_FCL2                   *((volatile  uint8_t *)(0x4271E28CUL))
#define bFM_MFS15_I2C_FCR_FSET                    *((volatile  uint8_t *)(0x4271E290UL))
#define bFM4_MFS15_I2C_FCR_FSET                   *((volatile  uint8_t *)(0x4271E290UL))
#define bFM_MFS15_I2C_FCR_FLD                     *((volatile  uint8_t *)(0x4271E294UL))
#define bFM4_MFS15_I2C_FCR_FLD                    *((volatile  uint8_t *)(0x4271E294UL))
#define bFM_MFS15_I2C_FCR_FLST                    *((volatile  uint8_t *)(0x4271E298UL))
#define bFM4_MFS15_I2C_FCR_FLST                   *((volatile  uint8_t *)(0x4271E298UL))
#define bFM_MFS15_I2C_FCR_FSEL                    *((volatile  uint8_t *)(0x4271E2A0UL))
#define bFM4_MFS15_I2C_FCR_FSEL                   *((volatile  uint8_t *)(0x4271E2A0UL))
#define bFM_MFS15_I2C_FCR_FTIE                    *((volatile  uint8_t *)(0x4271E2A4UL))
#define bFM4_MFS15_I2C_FCR_FTIE                   *((volatile  uint8_t *)(0x4271E2A4UL))
#define bFM_MFS15_I2C_FCR_FDRQ                    *((volatile  uint8_t *)(0x4271E2A8UL))
#define bFM4_MFS15_I2C_FCR_FDRQ                   *((volatile  uint8_t *)(0x4271E2A8UL))
#define bFM_MFS15_I2C_FCR_FRIIE                   *((volatile  uint8_t *)(0x4271E2ACUL))
#define bFM4_MFS15_I2C_FCR_FRIIE                  *((volatile  uint8_t *)(0x4271E2ACUL))
#define bFM_MFS15_I2C_FCR_FLSTE                   *((volatile  uint8_t *)(0x4271E2B0UL))
#define bFM4_MFS15_I2C_FCR_FLSTE                  *((volatile  uint8_t *)(0x4271E2B0UL))

#define bFM_MFS15_I2C_IBCR_INT                    *((volatile  uint8_t *)(0x4271E020UL))
#define bFM4_MFS15_I2C_IBCR_INT                   *((volatile  uint8_t *)(0x4271E020UL))
#define bFM_MFS15_I2C_IBCR_BER                    *((volatile  uint8_t *)(0x4271E024UL))
#define bFM4_MFS15_I2C_IBCR_BER                   *((volatile  uint8_t *)(0x4271E024UL))
#define bFM_MFS15_I2C_IBCR_INTE                   *((volatile  uint8_t *)(0x4271E028UL))
#define bFM4_MFS15_I2C_IBCR_INTE                  *((volatile  uint8_t *)(0x4271E028UL))
#define bFM_MFS15_I2C_IBCR_CNDE                   *((volatile  uint8_t *)(0x4271E02CUL))
#define bFM4_MFS15_I2C_IBCR_CNDE                  *((volatile  uint8_t *)(0x4271E02CUL))
#define bFM_MFS15_I2C_IBCR_WSEL                   *((volatile  uint8_t *)(0x4271E030UL))
#define bFM4_MFS15_I2C_IBCR_WSEL                  *((volatile  uint8_t *)(0x4271E030UL))
#define bFM_MFS15_I2C_IBCR_ACKE                   *((volatile  uint8_t *)(0x4271E034UL))
#define bFM4_MFS15_I2C_IBCR_ACKE                  *((volatile  uint8_t *)(0x4271E034UL))
#define bFM_MFS15_I2C_IBCR_ACT_SCC                *((volatile  uint8_t *)(0x4271E038UL))
#define bFM4_MFS15_I2C_IBCR_ACT_SCC               *((volatile  uint8_t *)(0x4271E038UL))
#define bFM_MFS15_I2C_IBCR_MSS                    *((volatile  uint8_t *)(0x4271E03CUL))
#define bFM4_MFS15_I2C_IBCR_MSS                   *((volatile  uint8_t *)(0x4271E03CUL))

